[
    {
        "context": "Euthydemus.\nIntroduction.\n\nThe Euthydemus, though apt to be regarded by us only as an elaborate jest, has also a very serious purpose. It may fairly claim to be the oldest treatise on logic; for that science originates in the misunderstandings which necessarily accompany the first efforts of speculation. Several of the fallacies which are satirized in it reappear in the Sophistici Elenchi of Aristotle and are retained at the end of our manuals of logic. But if the order of history were followed, they should be placed not at the end but at the beginning of them; for they belong to the age in which the human mind was first making the attempt to distinguish thought from sense, and to separate the universal from the particular or individual. How to put together words or ideas, how to escape ambiguities in the meaning of terms or in the structure of propositions, how to resist the fixed impression of an ‘eternal being’ or ‘perpetual flux,’ how to distinguish between words and things—these were problems not easy of solution in the infancy of philosophy. They presented the same kind of difficulty to the half–educated man which spelling or arithmetic do to the mind of a child. It was long before the new world of ideas which had been sought after with such passionate yearning was set in order and made ready for use. To us the fallacies which arise in the pre–Socratic philosophy are trivial and obsolete because we are no longer liable to fall into the errors which are expressed by them. The intellectual world has become better assured to us, and we are less likely to be imposed upon by illusions of words.\nThe logic of Aristotle is for the most part latent in the dialogues of Plato. The nature of definition is explained not by rules but by examples in the Charmides, Lysis, Laches, Protagoras, Meno, Euthyphro, Theaetetus, Gorgias, Republic; the nature of division is likewise illustrated by examples in the Sophist (p. 219 ff.) and Statesman (283 ff.); a scheme of categories is found in the Philebus (p. 66); the true doctrine of contradiction (436 ff.) is taught, and the fallacy of arguing in a circle (p. 505) is exposed in the Republic; the nature of synthesis and analysis is graphically described in the Phaedrus (p. 265); the nature of words is analysed in the Cratylus; the form of the syllogism is indicated in the genealogical trees of the Sophist and Statesman; a true doctrine of predication and an analysis of the sentence are given in the Sophist (p. 262); the different meanings of one and being are worked out in the Parmenides. Here we have most of the important elements of logic, not yet systematized or reduced to an art or science, but scattered up and down as they would naturally occur in ordinary discourse. They are of little or no use or significance to us; but because we have grown out of the need of them we should not therefore despise them. They are still interesting and instructive for the light which they shed on the history of the human mind.\nThere are indeed many old fallacies which linger among us, and new ones are constantly springing up. But they are not of the kind to which ancient logic can be usefully applied. The weapons of common sense, not the analytics of Aristotle, are needed for their overthrow. Nor is the use of the Aristotelian logic any longer natural to us. We no longer put arguments into the form of syllogisms like the schoolmen; the simple use of language has been, happily, restored to us. Neither do we discuss the nature of the proposition, nor extract hidden truths from the copula, nor dispute any longer about nominalism and realism. We do not confuse the form with the matter of knowledge, or invent laws of thought, or imagine that any single science furnishes a principle of reasoning to all the rest. Neither do we require categories or heads of argument to be invented for our use. Those who have no knowledge of logic, like some of our great physical philosophers, seem to be quite as good reasoners as those who have. Most of the ancient puzzles have been settled on the basis of usage and common sense; there is no need to reopen them. No science should raise problems or invent forms of thought which add nothing to knowledge and are of no use in assisting the acquisition of it. This seems to be the natural limit of logic and metaphysics; if they give us a more comprehensive or a more definite view of the different spheres of knowledge they are to be studied; if not, not. The better part of ancient logic appears hardly in our own day to have a separate existence; it is absorbed in two other sciences: (1) rhetoric, if indeed this ancient art be not also fading away into literary criticism; (2) the science of language, under which all questions relating to words and propositions and the combinations of them may properly be included.\nTo continue dead or imaginary sciences, which make no signs of progress and have no definite sphere, tends to interfere with the prosecution of living ones. The study of them is apt to blind the judgment and to render men incapable of seeing the value of evidence, and even of appreciating the nature of truth. Nor should we allow the living science to become confused with the dead by an ambiguity of language. The term logic has two different meanings, an ancient and a modern one, and we vainly try to bridge the gulf between them. Many perplexities are avoided by keeping them apart. There might certainly be a new science of logic; it would not however be built up out of the fragments of the old, but would be distinct from them—relative to the state of knowledge which exists at the present time, and based chiefly on the methods of Modern Inductive philosophy. Such a science might have two legitimate fields: first, the refutation and explanation of false philosophies still hovering in the air as they appear from the point of view of later experience or are comprehended in the history of the human mind, as in a larger horizon: secondly, it might furnish new forms of thought more adequate to the expression of all the diversities and oppositions of knowledge which have grown up in these latter days; it might also suggest new methods of enquiry derived from the comparison of the sciences. Few will deny that the introduction of the words ‘subject’ and ‘object’ and the Hegelian reconciliation of opposites have been ‘most gracious aids’ to psychology, or that the methods of Bacon and Mill have shed a light far and wide on the realms of knowledge. These two great studies, the one destructive and corrective of error, the other conservative and constructive of truth, might be a first and second part of logic. Ancient logic would be the propaedeutic or gate of approach to logical science,—nothing more. But to pursue such speculations further, though not irrelevant, might lead us too far away from the argument of the dialogue.\nThe Euthydemus is, of all the Dialogues of Plato, that in which he approaches most nearly to the comic poet. The mirth is broader, the irony more sustained, the contrast between Socrates and the two Sophists, although veiled, penetrates deeper than in any other of his writings. Even Thrasymachus, in the Republic, is at last pacified, and becomes a friendly and interested auditor of the great discourse. But in the Euthydemus the mask is never dropped; the accustomed irony of Socrates continues to the end. . . . . . .\n\nAnalysis.\n\nSocrates narrates to Crito a remarkable scene in which he has himself taken part, and in which the two brothers, Dionysodorus and Euthydemus, are the chief performers. They are natives of Chios, who had settled at Thurii, but were driven out, and in former days had been known at Athens as professors of rhetoric and of the art of fighting in armour. To this they have now added a new accomplishment—the art of Eristic, or fighting with words, which they are likewise willing to teach ‘for a consideration.’ But they can also teach virtue in a very short time and in the very best manner. Socrates, who is always on the look–out for teachers of virtue, is interested in the youth Cleinias, the grandson of the great Alcibiades, and is desirous that he should have the benefit of their instructions. He is ready to fall down and worship them: although the greatness of their professions does arouse in his mind a temporary incredulity.\nA circle gathers round them, in the midst of which are Socrates, the two brothers, the youth Cleinias, who is watched by the eager eyes of his lover Ctesippus, and others. The performance begins; and such a performance as might well seem to require an invocation of Memory and the Muses. It is agreed that the brothers shall question Cleinias. ‘Cleinias,’ says Euthydemus, ‘who learn, the wise or the unwise?’ ‘The wise,’ is the reply; given with blushing and hesitation. ‘And yet when you learned you did not know and were not wise.’ Then Dionysodorus takes up the ball: ‘Who are they who learn dictation of the grammar–master; the wise boys or the foolish boys?’ ‘The wise.’ ‘Then, after all, the wise learn.’ ‘And do they learn,’ said Euthydemus, ‘what they know or what they do not know?’ ‘The latter.’ ‘And dictation is a dictation of letters?’ ‘Yes.’ ‘And you know letters?’ ‘Yes.’ ‘Then you learn what you know.’ ‘But,’ retorts Dionysodorus, ‘is not learning acquiring knowledge?’ ‘Yes.’ ‘And you acquire that which you have not got already?’ ‘Yes.’ ‘Then you learn that which you do not know.’\nSocrates is afraid that the youth Cleinias may be discouraged at these repeated overthrows. He therefore explains to him the nature of the process to which he is being subjected. The two strangers are not serious; there are jests at the mysteries which precede the enthronement, and he is being initiated into the mysteries of the sophistical ritual. This is all a sort of horse–play, which is now ended. The exhortation to virtue will follow, and Socrates himself (if the wise men will not laugh at him) is desirous of showing the way in which such an exhortation should be carried on, according to his own poor notion. He proceeds to question Cleinias. The result of the investigation may be summed up as follows:—\nAll men desire good; and good means the possession of goods, such as wealth, health, beauty, birth, power, honour; not forgetting the virtues and wisdom. And yet in this enumeration the greatest good of all is omitted. What is that? Good fortune. But what need is there of good fortune when we have wisdom already:—in every art and business are not the wise also the fortunate? This is admitted. And again, the possession of goods is not enough; there must also be a right use of them which can only be given by knowledge: in themselves they are neither good nor evil—knowledge and wisdom are the only good, and ignorance and folly the only evil. The conclusion is that we must get ‘wisdom.’ But can wisdom be taught? ‘Yes,’ says Cleinias. The ingenuousness of the youth delights Socrates, who is at once relieved from the necessity of discussing one of his great puzzles. ‘Since wisdom is the only good, he must become a philosopher, or lover of wisdom.’ ‘That I will,’ says Cleinias.\nAfter Socrates has given this specimen of his own mode of instruction, the two brothers recommence their exhortation to virtue, which is of quite another sort.\n‘You want Cleinias to be wise?’ ‘Yes.’ ‘And he is not wise yet?’ ‘No.’ ‘Then you want him to be what he is not, and not to be what he is?—not to be—that is, to perish. Pretty lovers and friends you must all be!’\nHere Ctesippus, the lover of Cleinias, interposes in great excitement, thinking that he will teach the two Sophists a lesson of good manners. But he is quickly entangled in the meshes of their sophistry; and as a storm seems to be gathering Socrates pacifies him with a joke, and Ctesippus then says that he is not reviling the two Sophists, he is only contradicting them. ‘But,’ says Dionysodorus, ‘there is no such thing as contradiction. When you and I describe the same thing, or you describe one thing and I describe another, how can there be a contradiction?’ Ctesippus is unable to reply.\nSocrates has already heard of the denial of contradiction, and would like to be informed by the great master of the art, ‘What is the meaning of this paradox? Is there no such thing as error, ignorance, falsehood? Then what are they professing to teach?’ The two Sophists complain that Socrates is ready to answer what they said a year ago, but is ‘non–plussed’ at what they are saying now. ‘What does the word “non–plussed” mean?’ Socrates is informed, in reply, that words are lifeless things, and lifeless things have no sense or meaning. Ctesippus again breaks out, and again has to be pacified by Socrates, who renews the conversation with Cleinias. The two Sophists are like Proteus in the variety of their transformations, and he, like Menelaus in the Odyssey, iv. 306 ff., hopes to restore them to their natural form.\nHe had arrived at the conclusion that Cleinias must become a philosopher. And philosophy is the possession of knowledge; and knowledge must be of a kind which is profitable and may be used. What knowledge is there which has such a nature? Not the knowledge which is required in any particular art; nor again the art of the composer of speeches, who knows how to write them, but cannot speak them, although he too must be admitted to be a kind of enchanter of wild animals. Neither is the knowledge which we are seeking the knowledge of the general. For the general makes over his prey to the statesman, as the huntsman does to the cook, or the taker of quails to the keeper of quails; he has not the use of that which he acquires. The two enquirers, Cleinias and Socrates, are described as wandering about in a wilderness, vainly searching after the art of life and happiness. At last they fix upon the kingly art, as having the desired sort of knowledge. But the kingly art only gives men those goods which are neither good nor evil: and if we say further that it makes us wise, in what does it make us wise? Not in special arts, such as cobbling or carpentering, but only in itself: or say again that it makes us good, there is no answer to the question, ‘good in what?’ At length in despair Cleinias and Socrates turn to the ‘Dioscuri’ and request their aid.\nEuthydemus argues that Socrates knows something; and as he cannot know and not know, he cannot know some things and not know others, and therefore he knows all things: he and Dionysodorus and all other men know all things. ‘Do they know shoemaking, &c.?’ ‘Yes.’ The sceptical Ctesippus would like to have some evidence of this extraordinary statement: he will believe if Euthydemus will tell him how many teeth Dionysodorus has, and if Dionysodorus will give him a like piece of information about Euthydemus. Even Socrates is incredulous, and indulges in a little raillery at the expense of the brothers. But he restrains himself, remembering that if the men who are to be his teachers think him stupid they will take no pains with him. Another fallacy is produced which turns on the absoluteness of the verb ‘to know.’ And here Dionysodorus is caught ‘napping,’ and is induced by Socrates to confess that ‘he does not know the good to be unjust.’ Socrates appeals to his brother Euthydemus; at the same time he acknowledges that he cannot, like Heracles, fight against a Hydra, and even Heracles, on the approach of a second monster, called upon his nephew Iolaus to help. Dionysodorus rejoins that Iolaus was no more the nephew of Heracles than of Socrates. For a nephew is a nephew, and a brother is a brother, and a father is a father, not of one man only, but of all; nor of men only, but of dogs and sea–monsters. Ctesippus makes merry with the consequences which follow: ‘Much good has your father got out of the wisdom of his puppies.’\n‘But,’ says Euthydemus, unabashed, ‘nobody wants much good.’ Medicine is a good, arms are a good, money is a good, and yet there may be too much of them in wrong places. ‘No,’ says Ctesippus, ‘there cannot be too much gold.’ ‘And would you be happy if you had three talents of gold in your belly, a talent in your pate, and a stater in either eye?’ Ctesippus, imitating the new wisdom, replies, ‘And do not the Scythians reckon those to be the happiest of men who have their skulls gilded and see the inside of them?’ ‘Do you see,’ retorts Euthydemus, ‘what has the quality of vision or what has not the quality of vision?’ ‘What has the quality of vision.’ ‘And you see our garments?’ ‘Yes.’ ‘Then our garments have the quality of vision.’ A similar play of words follows, which is successfully retorted by Ctesippus, to the great delight of Cleinias, who is rebuked by Socrates for laughing at such solemn and beautiful things.\n‘But are there any beautiful things? And if there are such, are they the same or not the same as absolute beauty?’ Socrates replies that they are not the same, but cach of them has some beauty present with it. ‘And are you an ox because you have an ox present with you?’ After a few more amphiboliae, in which Socrates, like Ctesippus, in self–defence borrows the weapons of the brothers, they both confess that the two heroes are invincible; and the scene concludes with a grand chorus of shouting and laughing, and a panegyrical oration from Socrates:—\nFirst, he praises the indifference of Dionysodorus and Euthydemus to public opinion; for most persons would rather be refuted by such arguments than use them in the refutation of others. Secondly, he remarks upon their impartiality; for they stop their own mouths, as well as those of other people. Thirdly, he notes their liberality, which makes them give away their secret to all the world: they should be more reserved, and let no one be present at this exhibition who does not pay them a handsome fee; or better still they might practise on one another only. He concludes with a respectful request that they will receive him and Cleinias among their disciples.\nCrito tells Socrates that he has heard one of the audience criticise severely this wisdom,—not sparing Socrates himself for countenancing such an exhibition. Socrates asks what manner of man was this censorious critic. ‘Not an orator, but a great composer of speeches.’ Socrates understands that he is an amphibious animal, half philosopher, half politician; one of a class who have the highest opinion of themselves and a spite against philosophers, whom they imagine to be their rivals. They are a class who are very likely to get mauled by Euthydemus and his friends, and have a great notion of their own wisdom; for they imagine themselves to have all the advantages and none of the drawbacks both of politics and of philosophy. They do not understand the principles of combination, and hence are ignorant that the union of two good things which have different ends produces a compound inferior to either of them taken separately.\nCrito is anxious about the education of his children, one of whom is growing up. The description of Dionysodorus and Euthydemus suggests to him the reflection that the professors of education are strange beings. Socrates consoles him with the remark that the good in all professions are few, and recommends that ‘he and his house’ should continue to serve philosophy, and not mind about its professors.\n\nIntroduction.\n\nThere is a stage in the history of philosophy in which the old is dying out, and the new has not yet come into full life. Great philosophies like the Eleatic or Heraclitean, which have enlarged the boundaries of the human mind, begin to pass away in words. They subsist only as forms which have rooted themselves in language—as troublesome elements of thought which cannot be either used or explained away. The same absoluteness which was once attributed to abstractions is now attached to the words which are the signs of them. The philosophy which in the first and second generation was a great and inspiring effort of reflection, in the third becomes sophistical, verbal, eristic.\nIt is this stage of philosophy which Plato satirises in the Euthydemus. The fallacies which are noted by him appear trifling to us now, but they were not trifling in the age before logic, in the decline of the earlier Greek philosophies, at a time when language was first beginning to perplex human thought. Besides he is caricaturing them; they probably received more subtle forms at the hands of those who seriously maintained them. They are patent to us in Plato, and we are inclined to wonder how any one could ever have been deceived by them; but we must remember also that there was a time when the human mind was only with great difficulty disentangled from such fallacies.\nTo appreciate fully the drift of the Euthydemus, we should imagine a mental state in which not individuals only, but whole schools during more than one generation, were animated by the desire to exclude the conception of rest, and therefore the very word ‘this’ (Theaet. 183 C) from language; in which the ideas of space, time, matter, motion, were proved to be contradictory and imaginary; in which the nature of qualitative change was a puzzle, and even differences of degree, when applied to abstract notions, were not understood; in which there was no analysis of grammar, and mere puns or plays of words received serious attention; in which contradiction itself was denied, and, on the one hand, every predicate was affirmed to be true of every subject, and on the other, it was held that no predicate was true of any subject, and that nothing was, or was known, or could be spoken. Let us imagine disputes carried on with religious earnestness and more than scholastic subtlety, in which the catchwords of philosophy are completely detached from their context. (Cp. Theaet. 180.) To such disputes the humour, whether of Plato in the ancient, or of Pope and Swift in the modern world, is the natural enemy. Nor must we forget that in modern times also there is no fallacy so gross, no trick of language so transparent, no abstraction so barren and unmeaning, no form of thought so contradictory to experience, which has not been found to satisfy the minds of philosophical enquirers at a certain stage, or when regarded from a certain point of view only. The peculiarity of the fallacies of our own age is that we live within them, and are therefore generally unconscious of them.\nAristotle has analysed several of the same fallacies in his book ‘De Sophisticis Elenchis,’ which Plato, with equal command of their true nature, has preferred to bring to the test of ridicule. At first we are only struck with the broad humour of this ‘reductio ad absurdum:’ gradually we perceive that some important questions begin to emerge. Here, as everywhere else, Plato is making war against the philosophers who put words in the place of things, who tear arguments to tatters, who deny predication, and thus make knowledge impossible; to whom ideas and objects of sense have no fixedness, but are in a state of perpetual oscillation and transition. Two great truths seem to be indirectly taught through these fallacies: (1) The uncertainty of language, which allows the same words to be used in different meanings, or with different degrees of meaning: (2) The necessary limitation or relative nature of all phenomena. Plato is aware that his own doctrine of ideas (p. 301 A), as well as the Eleatic Being and Not–being, alike admit of being regarded as verbal fallacies (p. 284 A, B). The sophism advanced in the Meno (p. 80 D), ‘that you cannot enquire either into what you know or do not know,’ is lightly touched upon at the commencement of the Dialogue (pp. 275, 276); the thesis of Protagoras, that everything is true to him to whom it seems to be true, is satirized at p. 286. In contrast with these fallacies is maintained the Socratic doctrine that happiness is gained by knowledge. The grammatical puzzles with which the Dialogue concludes probably contain allusions to tricks of language which may have been practised by the disciples of Prodicus or Antisthenes. They would have had more point, if we were acquainted with the writings against which Plato’s humour is directed. Most of the jests appear to have a serious meaning; but we have lost the clue to some of them, and cannot determine whether, as in the Cratylus, Plato has or has not mixed up purely unmeaning fun with his satire.\nThe two discourses of Socrates may be contrasted in several respects with the exhibition of the Sophists: (1) In their perfect relevancy to the subject of discussion, whereas the Sophistical discourses are wholly irrelevant: (2) In their enquiring sympathetic tone, which encourages the youth, instead of ‘knocking him down,’ after the manner of the two Sophists: (3) In the absence of any definite conclusion—for while Socrates and the youth are agreed that philosophy is to be studied, they are not able to arrive at any certain result about the art which is to teach it. This is a question which will hereafter be answered in the Republic; as the conception of the kingly art (291, 292) is more fully developed in the Politicus, and the caricature of rhetoric (290) in the Gorgias.\nThe characters of the Dialogue are easily intelligible. There is Socrates once more in the character of an old man; and his equal in years, Crito, the father of Critobulus, like Lysimachus in the Laches, his fellow demesman (Apol. 33 D), to whom the scene is narrated, and who once or twice interrupts with a remark after the manner of the interlocutor in the Phaedo, and adds his commentary at the end; Socrates makes a playful allusion to his money–getting habits. There is the youth Cleinias, the grandson of Alcibiades, who may be compared with Lysis, Charmides, Menexenus, and other ingenuous youths out of whose mouths Socrates draws his own lessons, and to whom he always seems to stand in a kindly and sympathetic relation. Crito will not believe that Socrates has not improved or perhaps invented the answers of Cleinias (cp. Phaedrus, 275 B). The name of the grandson of Alcibiades, who is described as long dead, τον̂ παλαιον̂, and who died at the age of forty–four, in the year 404 b.c., suggests not only that the intended scene of the Euthydemus could not have been earlier than 404, but that as a fact this Dialogue could not have been composed before 390 at the soonest. Ctesippus, who is the lover of Cleinias, has been already introduced to us in the Lysis, and seems there too to deserve the character which is here given him, of a somewhat uproarious young man. But the chief study of all is the picture of the two brothers, who are unapproachable in their effrontery, equally careless of what they say to others and of what is said to them, and never at a loss. They are ‘Arcades ambo et cantare pares et respondere parati.’ Some superior degree of wit or subtlety is attributed to Euthydemus, who sees the trap in which Socrates catches Dionysodorus (296 A).\nThe epilogue or conclusion of the Dialogue has been criticised as inconsistent with the general scheme. Such a criticism is like similar criticisms on Shakespeare, and proceeds upon a narrow notion of the variety which the Dialogue, like the drama, seems to admit. Plato in the abundance of his dramatic power has chosen to write a play upon a play, just as he often gives us an argument within an argument. At the same time he takes the opportunity of assailing another class of persons who are as alien from the spirit of philosophy as Euthydemus and Dionysodorus. The Eclectic, the Syncretist, the Doctrinaire, have been apt to have a bad name both in ancient and modern times. The persons whom Plato ridicules in the epilogue to the Euthydemus are of this class. They occupy a border–ground between philosophy and politics; they keep out of the dangers of politics, and at the same time use philosophy as a means of serving their own interests. Plato quaintly describes them as making two good things, philosophy and politics, a little worse by perverting the objects of both. Men like Antiphon or Lysias would be types of the class. Out of a regard to the respectabilities of life, they are disposed to censure the interest which Socrates takes in the exhibition of the two brothers. They do not understand, any more than Crito, that he is pursuing his vocation of detecting the follies of mankind, which he finds ‘not unpleasant.’ (Cp. Apol. 23 B, 33 B.)\nEducation is the common subject of all Plato’s earlier Dialogues. The concluding remark of Crito, that he has a difficulty in educating his two sons, and the advice of Socrates to him that he should not give up philosophy because he has no faith in philosophers, seems to be a preparation for the more peremptory declaration of the Meno that ‘Virtue cannot be taught because there are no teachers.’\nThe reasons for placing the Euthydemus early in the series are: (1) the similarity in plan and style to the Protagoras, Charmides, and Lysis;—the relation of Socrates to the Sophists is still that of humorous antagonism, not, as in the later Dialogues of Plato, of embittered hatred; and the places and persons have a considerable family likeness; (2) the Euthydemus belongs to the Socratic period in which Socrates is represented as willing to learn, but unable to teach; and in the spirit of Xenophon’s Memorabilia, philosophy is defined as ‘the knowledge which will make us happy;’ (3) we seem to have passed the stage arrived at in the Protagoras, for Socrates is no longer discussing whether virtue can be taught—from this question he is relieved by the ingenuous declaration of the youth Cleinias; and (4) not yet to have reached the point at which he asserts ‘that there are no teachers.’ Such grounds are precarious, as arguments from style and plan are apt to be (ὀλισθηρότατον τὸ γένος). But no arguments equally strong can be urged in favour of assigning to the Euthydemus any other position in the series.\n\nEUTHYDEMUS.\nPERSONS OF THE DIALOGUE.\nSocrates, who is the narrator of the Dialogue.\nCrito.\nCleinias.\nEuthydemus.\nDionysodorus.\nCtesippus.\nScene:—The Lyceum.\n\nCrito.\n\nCrito, Socrates.\n\nWho was the person, Socrates, with whom you were talking yesterday at the Lyceum?",
        "question": " There was such a crowd around you that I could not get within hearing, but I caught a sight of him over their heads, and I made out, as I thought, that he was a stranger with whom you were talking: who was he?\n",
        "answer": "Socrates."
    },
    {
        "context": "There were two, Crito;",
        "question": " which of them do you mean?\n",
        "answer": "Cri."
    },
    {
        "context": "The one whom I mean was seated second from you on the right–hand side. In the middle was Cleinias the young son of Axiochus, who has wonderfully grown; he is only about the age of my own Critobulus, but he is much forwarder and very good–looking: the other is thin and looks younger than he is.\n\n\nSoc.\nHe whom you mean, Crito, is Euthydemus; and on my left hand there was his brother Dionysodorus, who also took part in the conversation.\n\n\nCri.\n1 Neither of them are known to me, Socrates; they are a new importation of Sophists, as I should imagine.",
        "question": " Of what country are they, and what is their line of wisdom?\n",
        "answer": "Soc."
    },
    {
        "context": "\nThe various accomplishments of Euthydemus and Dionysodorus.\n\nAs to their origin, I believe that they are natives of this part of the world, and have migrated from Chios to Thurii; they were driven out of Thurii, and have been living for many years past in these regions. As to their wisdom, about which you ask, Crito, they are wonderful—consummate! I never knew what the true pancratiast was before; they are simply made up of fighting, not like the two Acarnanian brothers who fight with their bodies only, but this pair of heroes, besides being perfect in the use of their bodies, are invincible in every sort of warfare; for they are capital at fighting in armour, and will teach the art to any one who pays them; and also they are most skilful in legal warfare; they will plead themselves and teach others to speak and to compose speeches which will have an effect upon the courts. And this was only the beginning of their wisdom, but they have at last carried out the pancratiastic art to the very end, and have mastered the only mode of fighting which had been hitherto neglected by them; and now no one dares even to stand up against them: such is their skill in the war of words, that they can refute any proposition whether true or false. Now I am thinking, Crito, of placing myself in their hands; for they say that in a short time they can impart their skill to any one.\n\n\nCri.\nBut, Socrates, are you not too old? there may be reason to fear that.\n\n\nSoc.\n\nSocrates thinks that he is not too old to become their pupil.\n\nCertainly not, Crito; as I will prove to you, for I have the consolation of knowing that they began this art of disputation which I covet, quite, as I may say, in old age; last year, or the year before, they had none of their new wisdom. I am only apprehensive that I may bring the two strangers into disrepute, as I have done Connus the son of Metrobius, the harp–player, who is still my music–master; for when the boys who go to him see me going with them, they laugh at me and call him grandpapa’s master. Now I should not like the strangers to experience similar treatment; the fear of ridicule may make them unwilling to receive me; and therefore, Crito, I shall try and persuade some old men to accompany me to them, as I persuaded them to go with me to Connus, and I hope that you will make one: and perhaps we had better take your sons as a bait; they will want to have them as pupils, and for the sake of them will be willing to receive us.\n\n\nCri.\nI see no objection, Socrates, if you like; but first I wish that you would give me a description of their wisdom, that I may know beforehand what we are going to learn.\n\n\nSoc.\n\nHe describes the scene of which he had been a witness.\nThe youth Cleinias and his lover Ctesippus.\n\nIn less than no time you shall hear; for I cannot say that I did not attend—I paid great attention to them, and I remember and will endeavour to repeat the whole story. Providentially I was sitting alone in the dressing–room of the Lyceum where you saw me, and was about to depart; when I was getting up I recognized the familiar divine sign: so I sat down again, and in a little while the two brothers Euthydemus and Dionysodorus came in, and several others with them, whom I believe to be their disciples, and they walked about in the covered court; they had not taken more than two or three turns when Cleinias entered, who, as you truly say, is very much improved: he was followed by a host of lovers, one of whom was Ctesippus the Paeanian, a well–bred youth, but also having the wildness of youth. Cleinias saw me from the entrance as I was sitting alone, and at once came and sat down on the right hand of me, as you describe; and Dionysodorus and Euthydemus, when they saw him, at first stopped and talked with one another, now and then glancing at us, for I particularly watched them; and then Euthydemus came and sat down by the youth, and the other by me on the left hand; the rest anywhere. I saluted the brothers, whom I had not seen for a long time; and then I said to Cleinias: Here are two wise men, Euthydemus and Dionysodorus, Cleinias, wise not in a small but in a large way of wisdom, for they know all about war,—all that a good general ought to know about the array and command of an army, and the whole art of fighting in armour: and they know about law too, and can teach a man how to use the weapons of the courts when he is injured.\nThey heard me say this, but only despised me. I observed that they looked at one another, and both of them laughed; and then Euthydemus said: Those, Socrates, are matters which we no longer pursue seriously; to us they are secondary occupations.\nIndeed, I said, if such occupations are regarded by you as secondary, what must the principal one be;",
        "question": " tell me, I beseech you, what that noble study is?\n",
        "answer": "The two Sophists have given up teaching the arts; they are now engaged in teaching virtue."
    },
    {
        "context": "\nThe teaching of virtue, Socrates, he replied, is our principal occupation; and we believe that we can impart it better and quicker than any man.\nMy God! I said, and where did you learn that? I always thought, as I was saying just now, that your chief accomplishment was the art of fighting in armour; and I used to say as much of you, for I remember that you professed this when you were here before. But now if you really have the other knowledge, O forgive me: I address you as I would superior beings, and ask you to pardon the impiety of my former expressions. But are you quite sure about this, Dionysodorus and Euthydemus? the promise is so vast, that a feeling of incredulity steals over me.\nYou may take our word, Socrates, for the fact.\nThen I think you happier in having such a treasure than the great king is in the possession of his kingdom. And please to tell me whether you intend to exhibit your wisdom;",
        "question": " or what will you do?\n",
        "answer": "That is why we have come hither, Socrates; and our purpose is not only to exhibit, but also to teach any one who likes to learn."
    },
    {
        "context": "That is why we have come hither, Socrates; and our purpose is not only to exhibit, but also to teach any one who likes to learn.",
        "question": "\n\nCan they teach virtue to those only who are willing or to those also who are unwilling to learn?\n",
        "answer": "But I can promise you, I said, that every unvirtuous person will want to learn. I shall be the first; and there is the youth Cleinias, and Ctesippus: and here are several others, I said, pointing to the lovers of Cleinias, who were beginning to gather round us. Now Ctesippus was sitting at some distance from Cleinias; and when Euthydemus leaned forward in talking with me, he was prevented from seeing Cleinias, who was between us; and so, partly because he wanted to look at his love, and also because he was interested, he jumped up and stood opposite to us: and all the other admirers of Cleinias, as well as the disciples of Euthydemus and Dionysodorus, followed his example. And these were the persons whom I showed to Euthydemus, telling him that they were all eager to learn: to which Ctesippus and all of them with one voice vehemently assented, and bid him exhibit the power of his wisdom. Then I said: O Euthydemus and Dionysodorus, I earnestly request you to do myself and the company the favour to exhibit. There may be some trouble in giving the whole exhibition; but tell me one thing,—can you make a good man of him only who is already convinced that he ought to learn of you, or of him also who is not convinced, either because he imagines that virtue is a thing which cannot be taught at all, or that you are not the teachers of it? Has your art power to persuade him, who is of the latter temper of mind, that virtue can be taught;"
    },
    {
        "context": "But I can promise you, I said, that every unvirtuous person will want to learn. I shall be the first; and there is the youth Cleinias, and Ctesippus: and here are several others, I said, pointing to the lovers of Cleinias, who were beginning to gather round us. Now Ctesippus was sitting at some distance from Cleinias; and when Euthydemus leaned forward in talking with me, he was prevented from seeing Cleinias, who was between us; and so, partly because he wanted to look at his love, and also because he was interested, he jumped up and stood opposite to us: and all the other admirers of Cleinias, as well as the disciples of Euthydemus and Dionysodorus, followed his example. And these were the persons whom I showed to Euthydemus, telling him that they were all eager to learn: to which Ctesippus and all of them with one voice vehemently assented, and bid him exhibit the power of his wisdom. Then I said: O Euthydemus and Dionysodorus, I earnestly request you to do myself and the company the favour to exhibit. There may be some trouble in giving the whole exhibition; but tell me one thing,—can you make a good man of him only who is already convinced that he ought to learn of you, or of him also who is not convinced, either because he imagines that virtue is a thing which cannot be taught at all, or that you are not the teachers of it? Has your art power to persuade him, who is of the latter temper of mind, that virtue can be taught;",
        "question": " and that you are the men from whom he will best learn it?\n",
        "answer": "Certainly, Socrates, said Dionysodorus; our art will do both."
    },
    {
        "context": "Certainly, Socrates, said Dionysodorus; our art will do both.",
        "question": "\nAnd you and your brother, Dionysodorus, I said, of all men who are now living are the most likely to stimulate him to philosophy and to the study of virtue?\n",
        "answer": "Yes, Socrates, I rather think that we are."
    },
    {
        "context": "Then I wish that you would be so good as to defer the other part of the exhibition, and only try to persuade the youth whom you see here that he ought to be a philosopher and study virtue. Exhibit that, and you will confer a great favour on me and on every one present; for the fact is I and all of us are extremely anxious that he should become truly good. His name is Cleinias, and he is the son of Axiochus, and grandson of the old Alcibiades, cousin of the Alcibiades that now is. He is quite young, and we are naturally afraid that some one may get the start of us, and turn his mind in a wrong direction, and he may be ruined. Your visit, therefore, is most happily timed; and I hope that you will make a trial of the young man, and converse with him in our presence, if you have no objection.\n\nEuthydemus begins in a lofty and cheerful tone.\n\nThese were pretty nearly the expressions which I used; and Euthydemus, in a manly and at the same time encouraging tone, replied: There can be no objection, Socrates, if the young man is only willing to answer questions.\nHe is quite accustomed to do so, I replied; for his friends often come and ask him questions and argue with him; and therefore he is quite at home in answering.\n\nThe scene which followed was beyond description.\n\nWhat followed, Crito, how can I rightly narrate? For not slight is the task of rehearsing infinite wisdom, and therefore, like the poets, I ought to commence my relation with an invocation to Memory and the Muses.",
        "question": " Now Euthydemus, if I remember rightly, began nearly as follows: O Cleinias, are those who learn the wise or the ignorant?\n",
        "answer": "The youth, overpowered by the question, blushed, and in his perplexity looked at me for help; and I, knowing that he was disconcerted, said: Take courage, Cleinias, and answer like a man whichever you think; for my belief is that you will derive the greatest benefit from their questions."
    },
    {
        "context": "Whichever he answers, said Dionysodorus, leaning forward so as to catch my ear, his face beaming with laughter, I prophesy that he will be refuted, Socrates.\n\nThe wise only learn:\n\nWhile he was speaking to me, Cleinias gave his answer: and therefore I had no time to warn him of the predicament in which he was placed, and he answered that those who learned were the wise.",
        "question": "\nEuthydemus proceeded: There are some whom you would call teachers, are there not?\n",
        "answer": "The boy assented."
    },
    {
        "context": "And they are the teachers of those who learn—the grammar–master and the lyre–master used to teach you and other boys;",
        "question": " and you were the learners?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\n\nand yet those who learn are unlearned:\n\nAnd when you were learners you did not as yet know the things which you were learning?\n",
        "answer": "No, he said."
    },
    {
        "context": "No, he said.",
        "question": "\nAnd were you wise then?\n",
        "answer": "No, indeed, he said."
    },
    {
        "context": "No, indeed, he said.",
        "question": "\nBut if you were not wise you were unlearned?\n",
        "answer": "Certainly."
    },
    {
        "context": "Certainly.",
        "question": "\nYou then, learning what you did not know, were unlearned when you were learning?\n",
        "answer": "The youth nodded assent."
    },
    {
        "context": "\nand therefore the unlearned learn and not the wise.\n\nThen the unlearned learn1, and not the wise, Cleinias, as you imagine.\nAt these words the followers of Euthydemus, of whom I spoke, like a chorus at the bidding of their director, laughed and cheered. Then, before the youth had time to recover his breath, Dionysodorus cleverly took him in hand, and said: Yes, Cleinias;",
        "question": " and when the grammar–master dictated anything to you, were they the wise boys or the unlearned who learned the dictation?\n",
        "answer": "The wise, replied Cleinias."
    },
    {
        "context": "Then after all the wise are the learners and not the unlearned; and your last answer to Euthydemus was wrong.\nThen once more the admirers of the two heroes, in an ecstasy at their wisdom, gave vent to another peal of laughter, while the rest of us were silent and amazed. Euthydemus, observing this, determined to persevere with the youth; and in order to heighten the effect went on asking another similar question, which might be compared to the double turn of an expert dancer.",
        "question": " Do those, said he, who learn, learn what they know, or what they do not know?\n",
        "answer": "A similar trick of argument."
    },
    {
        "context": "\nAgain Dionysodorus whispered to me: That, Socrates, is just another of the same sort.\nGood heavens, I said; and your last question was so good!\nLike all our other questions, Socrates, he replied—inevitable.\nI see the reason, I said, why you are in such reputation among your disciples.\n\nThe teacher dictates to his pupils that which they do not know; and yet he dictates letters which they know.\n\nMeanwhile Cleinias had answered Euthydemus that those who learned learn what they do not know; and he put him through a series of questions the same as before.",
        "question": "\nDo you not know letters?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nAll letters?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\nBut when the teacher dictates to you, does he not dictate letters?\n",
        "answer": "To this also he assented."
    },
    {
        "context": "To this also he assented.",
        "question": "\nThen if you know all letters, he dictates that which you know?\n",
        "answer": "This again was admitted by him."
    },
    {
        "context": "Then, said the other, you do not learn that which he dictates;",
        "question": " but he only who does not know letters learns?\n",
        "answer": "Nay, said Cleinias; but I do learn."
    },
    {
        "context": "Nay, said Cleinias; but I do learn.",
        "question": "\nThen, said he, you learn what you know, if you know all the letters?\n",
        "answer": "He admitted that."
    },
    {
        "context": "Then, he said, you were wrong in your answer.\nThe word was hardly out of his mouth when Dionysodorus took up the argument, like a ball which he caught, and had another throw at the youth. Cleinias, he said, Euthydemus is deceiving you.",
        "question": " For tell me now, is not learning acquiring knowledge of that which one learns?\n",
        "answer": "Cleinias assented."
    },
    {
        "context": "\nThe trick reversed.",
        "question": "\n\nAnd knowing is having knowledge at the time?\n",
        "answer": "He agreed."
    },
    {
        "context": "He agreed.",
        "question": "\nAnd not knowing is not having knowledge at the time?\n",
        "answer": "He admitted that."
    },
    {
        "context": "He admitted that.",
        "question": "\nAnd are those who acquire those who have or have not a thing?\n",
        "answer": "Those who have not."
    },
    {
        "context": "Those who have not.",
        "question": "\nAnd have you not admitted that those who do not know are of the number of those who have not?\n",
        "answer": "He nodded assent."
    },
    {
        "context": "He nodded assent.",
        "question": "\nThen those who learn are of the class of those who acquire, and not of those who have?\n",
        "answer": "He agreed."
    },
    {
        "context": "Then, Cleinias, he said, those who do not know learn, and not those who know.\n\nSocrates explains to Cleinias the sophistical mode of procedure.\nThe two Sophists were having a game of play with him.\n\nEuthydemus was proceeding to give the youth a third fall; but I knew that he was in deep water, and therefore, as I wanted to give him a respite lest he should be disheartened, I said to him consolingly: You must not be surprised, Cleinias, at the singularity of their mode of speech: this I say because you may not understand what the two strangers are doing with you; they are only initiating you after the manner of the Corybantes in the mysteries; and this answers to the enthronement, which, if you have ever been initiated, is, as you will know, accompanied by dancing and sport; and now they are just prancing and dancing about you, and will next proceed to initiate you; imagine then that you have gone through the first part of the sophistical ritual, which, as Prodicus says, begins with initiation into the correct use of terms. The two foreign gentlemen, perceiving that you did not know, wanted to explain to you that the word ‘to learn’ has two meanings, and is used, first, in the sense of acquiring knowledge of some matter of which you previously have no knowledge, and also, when you have the knowledge, in the sense of reviewing this matter, whether something done or spoken by the light of this newly–acquired knowledge; the latter is generally called ‘knowing’ rather than ‘learning,’ but the word ‘learning’ is also used; and you did not see, as they explained to you, that the term is employed of two opposite sorts of men, of those who know, and of those who do not know. There was a similar trick in the second question, when they asked you whether men learn what they know or what they do not know. These parts of learning are not serious, and therefore I say that the gentlemen are not serious, but are only playing with you. For if a man had all that sort of knowledge that ever was, he would not be at all the wiser; he would only be able to play with men, tripping them up and oversetting them with distinctions of words. He would be like a person who pulls away a stool from some one when he is about to sit down, and then laughs and makes merry at the sight of his friend overturned and laid on his back. And you must regard all that has hitherto passed between you and them as merely play. But in what is to follow I am certain that they will exhibit to you their serious purpose, and keep their promise (I will show them how); for they promised to give me a sample of the hortatory philosophy, but I suppose that they wanted to have a game with you first. And now, Euthydemus and Dionysodorus, I think that we have had enough of this. Will you let me see you explaining to the young man how he is to apply himself to the study of virtue and wisdom? And I will first show you what I conceive to be the nature of the task, and what sort of a discourse I desire to hear; and if I do this in a very inartistic and ridiculous manner, do not laugh at me, for I only venture to improvise before you because I am eager to hear your wisdom: and I must therefore ask you and your disciples to refrain from laughing. And now, O son of Axiochus, let me put a question to you: Do not all men desire happiness?",
        "question": " And yet, perhaps, this is one of those ridiculous questions which I am afraid to ask, and which ought not to be asked by a sensible man: for what human being is there who does not desire happiness?\n",
        "answer": "There is no one, said Cleinias, who does not."
    },
    {
        "context": "Well, then, I said, since we all of us desire happiness, how can we be happy?—that is the next question. Shall we not be happy if we have many good things? And this, perhaps, is even a more simple question than the first, for there can be no doubt of the answer.\n\nHappiness is the possession of many good things:\n\nHe assented.\nAnd what things do we esteem good? No solemn sage is required to tell us this, which may be easily answered; for every one will say that wealth is a good.\nCertainly, he said.\n\nand good things are wealth, health, beauty, good birth, power, honour, and all the duties, justice, temperance, courage, wisdom.",
        "question": "\n\nAnd are not health and beauty goods, and other personal gifts?\n",
        "answer": "He agreed."
    },
    {
        "context": "He agreed.",
        "question": "\nCan there be any doubt that good birth, and power, and honours in one’s own land, are goods?\n",
        "answer": "He assented."
    },
    {
        "context": "And what other goods are there? I said. What do you say of temperance, justice, courage: do you not verily and indeed think, Cleinias, that we shall be more right in ranking them as goods than in not ranking them as goods? For a dispute might possibly arise about this.",
        "question": " What then do you say?\n",
        "answer": "They are goods, said Cleinias."
    },
    {
        "context": "Very well, I said;",
        "question": " and where in the company shall we find a place for wisdom—among the goods or not?\n",
        "answer": "Among the goods."
    },
    {
        "context": "And now, I said, think whether we have left out any considerable goods.\nI do not think that we have, said Cleinias.\nUpon recollection, I said, indeed I am afraid that we have left out the greatest of them all.\nWhat is that? he asked.\nFortune, Cleinias, I replied; which all, even the most foolish, admit to be the greatest of goods.\nTrue, he said.\n\nBut we have omitted, or rather not omitted, good–fortune; for it is already contained in wisdom.\n\nOn second thoughts, I added, how narrowly, O son of Axiochus, have you and I escaped making a laughing–stock of ourselves to the strangers.",
        "question": "\nWhy do you say so?\n",
        "answer": "Why, because we have already spoken of good–fortune, and are but repeating ourselves."
    },
    {
        "context": "Why, because we have already spoken of good–fortune, and are but repeating ourselves.",
        "question": "\nWhat do you mean?\n",
        "answer": "I mean that there is something ridiculous in again putting forward good–fortune, which has a place in the list already, and saying the same thing twice over."
    },
    {
        "context": "He asked what was the meaning of this, and I replied: Surely wisdom is good–fortune; even a child may know that.\n\nThe fortunate are only the wise under another name.\n\nThe simple–minded youth was amazed;",
        "question": " and, observing his surprise, I said to him: Do you not know, Cleinias, that flute–players are most fortunate and successful in performing on the flute?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nAnd are not the scribes most fortunate in writing and reading letters?\n",
        "answer": "Certainly."
    },
    {
        "context": "Certainly.",
        "question": "\nAmid the dangers of the sea, again, are any more fortunate on the whole than wise pilots?\n",
        "answer": "None, certainly."
    },
    {
        "context": "None, certainly.",
        "question": "\nAnd if you were engaged in war, in whose company would you rather take the risk—in company with a wise general, or with a foolish one?\n",
        "answer": "With a wise one."
    },
    {
        "context": "With a wise one.",
        "question": "\nAnd if you were ill, whom would you rather have as a companion in a dangerous illness—a wise physician, or an ignorant one?\n",
        "answer": "A wise one."
    },
    {
        "context": "A wise one.",
        "question": "\nYou think, I said, that to act with a wise man is more fortunate than to act with an ignorant one?\n",
        "answer": "He assented."
    },
    {
        "context": "\nAnd we are deemed fortunate when we are possessed of many good things. But we must use them as well as have them.\n\n Then wisdom always makes men fortunate: for by wisdom no man would ever err, and therefore he must act rightly and succeed, or his wisdom would be wisdom no longer.\nWe contrived at last, somehow or other, to agree in a general conclusion, that he who had wisdom had no need of fortune. I then recalled to his mind the previous state of the question.",
        "question": " You remember, I said, our making the admission that we should be happy and fortunate if many good things were present with us?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nAnd should we be happy by reason of the presence of good things, if they profited us not, or if they profited us?\n",
        "answer": "If they profited us, he said."
    },
    {
        "context": "And would they profit us, if we only had them and did not use them?",
        "question": " For example, if we had a great deal of food and did not eat, or a great deal of drink and did not drink, should we be profited?\n",
        "answer": "Certainly not, he said."
    },
    {
        "context": "Or would an artisan, who had all the implements necessary for his work, and did not use them, be any the better for the possession of them?",
        "question": " For example, would a carpenter be any the better for having all his tools and plenty of wood, if he never worked?\n",
        "answer": "Certainly not, he said."
    },
    {
        "context": "Certainly not, he said.",
        "question": "\nAnd if a person had wealth and all the goods of which we were just now speaking, and did not use them, would he be happy because he possessed them?\n",
        "answer": "No indeed, Socrates."
    },
    {
        "context": "Then, I said, a man who would be happy must not only have the good things, but he must also use them;",
        "question": " there is no advantage in merely having them?\n",
        "answer": "True."
    },
    {
        "context": "True.",
        "question": "\nWell, Cleinias, but if you have the use as well as the possession of good things, is that sufficient to confer happiness?\n",
        "answer": "Yes, in my opinion."
    },
    {
        "context": "Yes, in my opinion.",
        "question": "\nAnd may a person use them either rightly or wrongly?\n",
        "answer": "He must use them rightly."
    },
    {
        "context": "That is quite true, I said. And the wrong use of a thing is far worse than the non–use; for the one is an evil, and the other is neither a good nor an evil.",
        "question": " You admit that?\n",
        "answer": "He assented."
    },
    {
        "context": "\nIllustrations of the necessity of knowledge taken from the arts.",
        "question": "\n\nNow in the working and use of wood, is not that which gives the right use simply the knowledge of the carpenter?\n",
        "answer": "Nothing else, he said."
    },
    {
        "context": "Nothing else, he said.",
        "question": "\nAnd surely, in the manufacture of vessels, knowledge is that which gives the right way of making them?\n",
        "answer": "He agreed."
    },
    {
        "context": "He agreed.",
        "question": "\nAnd in the use of the goods of which we spoke at first—wealth and health and beauty, is not knowledge that which directs us to the right use of them, and regulates our practice about them?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nThen in every possession and every use of a thing, knowledge is that which gives a man not only good–fortune but success?\n",
        "answer": "He again assented."
    },
    {
        "context": "And tell me, I said, O tell me, what do possessions profit a man, if he have neither good sense nor wisdom? Would a man be better off, having and doing many things without wisdom, or a few things with wisdom? Look at the matter thus: If he did fewer things would he not make fewer mistakes? if he made fewer mistakes would he not have fewer misfortunes?",
        "question": " and if he had fewer misfortunes would he not be less miserable?\n",
        "answer": "Certainly, he said."
    },
    {
        "context": "Certainly, he said.",
        "question": "\nAnd who would do least—a poor man or a rich man?\n",
        "answer": "A poor man."
    },
    {
        "context": "A poor man.",
        "question": "\nA weak man or a strong man?\n",
        "answer": "A weak man."
    },
    {
        "context": "A weak man.",
        "question": "\nA noble man or a mean man?\n",
        "answer": "A mean man."
    },
    {
        "context": "A mean man.",
        "question": "\nAnd a coward would do less than a courageous and temperate man?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\nAnd an indolent man less than an active man?\n",
        "answer": "He assented."
    },
    {
        "context": "And a slow man less than a quick;",
        "question": " and one who had dull perceptions of seeing and hearing less than one who had keen ones?\n",
        "answer": "All this was mutually allowed by us."
    },
    {
        "context": "\nThe element of knowledge or wisdom is essential to good,\n\nThen, I said, Cleinias, the sum of the matter appears to be that the goods of which we spoke before are not to be regarded as goods in themselves, but the degree of good and evil in them depends on whether they are or are not under the guidance of knowledge: under the guidance of ignorance, they are greater evils than their opposites, inasmuch as they are more able to minister to the evil principle which rules them;",
        "question": " and when under the guidance of wisdom and prudence, they are greater goods: but in themselves they are nothing?\n",
        "answer": "That, he replied, is obvious."
    },
    {
        "context": "What then is the result of what has been said?",
        "question": " Is not this the result—that other things are indifferent, and that wisdom is the only good, and ignorance the only evil?\n",
        "answer": "He assented."
    },
    {
        "context": "\nor rather to the true and only good.",
        "question": "\n\nLet us consider a further point, I said: Seeing that all men desire happiness, and happiness, as has been shown, is gained by a use, and a right use, of the things of life, and the right use of them, and good–fortune in the use of them, is given by knowledge,—the inference is that everybody ought by all means to try and make himself as wise as he can?\n",
        "answer": "Yes, he said."
    },
    {
        "context": "\nTo get wisdom is necessary and honourable, if only wisdom can be taught.\n\nAnd when a man thinks that he ought to obtain this treasure, far more than money, from a father or a guardian or a friend or a suitor, whether citizen or stranger—the eager desire and prayer to them that they would impart wisdom to you, is not at all dishonourable, Cleinias; nor is any one to be blamed for doing any honourable service or ministration to any man, whether a lover or not, if his aim is to get wisdom. Do you agree? I said.\n\nThe youthful Cleinias is confident that it may.\n\nYes, he said, I quite agree, and think that you are right.\nYes, I said, Cleinias, if only wisdom can be taught, and does not come to man spontaneously; for this is a point which has still to be considered, and is not yet agreed upon by you and me—\nBut I think, Socrates, that wisdom can be taught, he said.\nBest of men, I said, I am delighted to hear you say so; and I am also grateful to you for having saved me from a long and tiresome investigation as to whether wisdom can be taught or not.",
        "question": " But now, as you think that wisdom can be taught, and that wisdom only can make a man happy and fortunate, will you not acknowledge that all of us ought to love wisdom, and you individually will try to love her?\n",
        "answer": "Certainly, Socrates, he said; I will do my best."
    },
    {
        "context": "I was pleased at hearing this; and I turned to Dionysodorus and Euthydemus and said: That is an example, clumsy and tedious I admit, of the sort of exhortations which I would have you give; and I hope that one of you will set forth what I have been saying in a more artistic style: or at least take up the enquiry where I left off, and proceed to show the youth whether he should have all knowledge; or whether there is one sort of knowledge only which will make him good and happy, and what that is. For, as I was saying at first, the improvement of this young man in virtue and wisdom is a matter which we have very much at heart.\nThus I spoke, Crito, and was all attention to what was coming. I wanted to see how they would approach the question, and where they would start in their exhortation to the young man that he should practise wisdom and virtue. Dionysodorus, who was the elder, spoke first. Everybody’s eyes were directed towards him, perceiving that something wonderful might shortly be expected. And certainly they were not far wrong; for the man, Crito, began a remarkable discourse well worth hearing, and wonderfully persuasive regarded as an exhortation to virtue.",
        "question": "\nTell me, he said, Socrates and the rest of you who say that you want this young man to become wise, are you in jest or in real earnest?\n",
        "answer": "I was led by this to imagine that they fancied us to have been jesting when we asked them to converse with the youth, and that this made them jest and play, and being under this impression, I was the more decided in saying that we were in profound earnest. Dionysodorus said:"
    },
    {
        "context": "\nThe quibble of Dionysodorus: Those who wish Cleinias not to be ignorant wish him not to be.\n\nReflect, Socrates; you may have to deny your words.\nI have reflected, I said; and I shall never deny my words.",
        "question": "\nWell, said he, and so you say that you wish Cleinias to become wise?\n",
        "answer": "Undoubtedly."
    },
    {
        "context": "Undoubtedly.",
        "question": "\nAnd he is not wise as yet?\n",
        "answer": "At least his modesty will not allow him to say that he is."
    },
    {
        "context": "At least his modesty will not allow him to say that he is.",
        "question": "\nYou wish him, he said, to become wise and not to be ignorant?\n",
        "answer": "That we do."
    },
    {
        "context": "That we do.",
        "question": "\nYou wish him to be what he is not, and no longer to be what he is?\n",
        "answer": "I was thrown into consternation at this."
    },
    {
        "context": "Taking advantage of my consternation he added: You wish him no longer to be what he is, which can only mean that you wish him to perish. Pretty lovers and friends they must be who want their favourite not to be, or to perish!\n\nIndignation of Ctesippus.\n\nWhen Ctesippus heard this he got very angry (as a lover well might) and said: Stranger of Thurii—if politeness would allow me I should say, A plague upon you!",
        "question": " What can make you tell such a lie about me and the others, which I hardly like to repeat, as that I wish Cleinias to perish?\n",
        "answer": "No one can tell a lie, says Euthydemus, for no one can do what is not, and, if saying is doing, no one can say what is not."
    },
    {
        "context": "No one can tell a lie, says Euthydemus, for no one can do what is not, and, if saying is doing, no one can say what is not.",
        "question": "\n\nEuthydemus replied: And do you think, Ctesippus, that it is possible to tell a lie?\n",
        "answer": "Yes, said Ctesippus; I should be mad to say anything else."
    },
    {
        "context": "Yes, said Ctesippus; I should be mad to say anything else.",
        "question": "\nAnd in telling a lie, do you tell the thing of which you speak or not?\n",
        "answer": "You tell the thing of which you speak."
    },
    {
        "context": "You tell the thing of which you speak.",
        "question": "\nAnd he who tells, tells that thing which he tells, and no other?\n",
        "answer": "Yes, said Ctesippus."
    },
    {
        "context": "Yes, said Ctesippus.",
        "question": "\nAnd that is a distinct thing apart from other things?\n",
        "answer": "Certainly."
    },
    {
        "context": "Certainly.",
        "question": "\nAnd he who says that thing says that which is?\n",
        "answer": "Yes."
    },
    {
        "context": "And he who says that which is, says the truth. And therefore Dionysodorus, if he says that which is, says the truth of you and no lie.\nYes, Euthydemus, said Ctesippus; but in saying this, he says what is not.",
        "question": "\nEuthydemus answered: And that which is not is not?\n",
        "answer": "True."
    },
    {
        "context": "True.",
        "question": "\nAnd that which is not is nowhere?\n",
        "answer": "Nowhere."
    },
    {
        "context": "Nowhere.",
        "question": "\nAnd can any one do anything about that which has no existence, or do to Cleinias that which is not and is nowhere?\n",
        "answer": "I think not, said Ctesippus."
    },
    {
        "context": "I think not, said Ctesippus.",
        "question": "\nWell, but do rhetoricians, when they speak in the assembly, do nothing?\n",
        "answer": "Nay, he said, they do something."
    },
    {
        "context": "Nay, he said, they do something.",
        "question": "\nAnd doing is making?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\nAnd speaking is doing and making?\n",
        "answer": "He agreed."
    },
    {
        "context": "Then no one says that which is not, for in saying what is not he would be doing something; and you have already acknowledged that no one can do what is not. And therefore, upon your own showing, no one says what is false; but if Dionysodorus says anything, he says what is true and what is.\nYes, Euthydemus, said Ctesippus; but he speaks of things in a certain way and manner, and not as they really are.",
        "question": "\nWhy, Ctesippus, said Dionysodorus, do you mean to say that any one speaks of things as they are?\n",
        "answer": "Yes, he said,—all gentlemen and truth–speaking persons."
    },
    {
        "context": "Yes, he said,—all gentlemen and truth–speaking persons.",
        "question": "\nAnd are not good things good, and evil things evil?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nAnd you say that gentlemen speak of things as they are?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\nThen the good speak evil of evil things, if they speak of them as they are?\n",
        "answer": "Yes, indeed, he said; and they speak evil of evil men. And if I may give you a piece of advice, you had better take care that they do not speak evil of you, since I can tell you that the good speak evil of the evil."
    },
    {
        "context": "Yes, indeed, he said; and they speak evil of evil men. And if I may give you a piece of advice, you had better take care that they do not speak evil of you, since I can tell you that the good speak evil of the evil.",
        "question": "\nAnd do they speak great things of the great, rejoined Euthydemus, and warm things of the warm?\n",
        "answer": "To be sure they do, said Ctesippus; and they speak coldly of the insipid and cold dialectician."
    },
    {
        "context": "\nCtesippus and the Sophists begin to quarrel; but Socrates restores good–humour with a joke.\n\nYou are abusive, Ctesippus, said Dionysodorus, you are abusive!\nIndeed, I am not, Dionysodorus, he replied; for I love you and am giving you friendly advice, and, if I could, would persuade you not like a boor to say in my presence that I desire my beloved, whom I value above all men, to perish.\nI saw that they were getting exasperated with one another, so I made a joke with him and said: O Ctesippus, I think that we must allow the strangers to use language in their own way, and not quarrel with them about words, but be thankful for what they give us. If they know how to destroy men in such a way as to make good and sensible men out of bad and foolish ones—whether this is a discovery of their own, or whether they have learned from some one else this new sort of death and destruction which enables them to get rid of a bad man and turn him into a good one—if they know this (and they do know this—at any rate they said just now that this was the secret of their newly–discovered art)—let them, in their phraseology, destroy the youth and make him wise, and all of us with him. But if you young men do not like to trust yourselves with them, then fiat experimentum in corpore senis; I will be the Carian on whom they shall operate. And here I offer my old person to Dionysodorus; he may put me into the pot, like Medea the Colchian, kill me, boil me, if he will only make me good.\nCtesippus said: And I, Socrates, am ready to commit myself to the strangers; they may skin me alive, if they please (and I am pretty well skinned by them already), if only my skin is made at last, not like that of Marsyas, into a leathern bottle, but into a piece of virtue. And here is Dionysodorus fancying that I am angry with him, when really I am not angry at all; I do but contradict him when I think that he is speaking improperly to me: and you must not confound abuse and contradiction, O illustrious Dionysodorus; for they are quite different things.\n\nDionysodorus denies the possibility of contradiction.\n\nContradiction! said Dionysodorus; why, there never was such a thing.\n\nIf no man can affirm a negation, no one can contradict.\n\nCertainly there is, he replied; there can be no question of that.",
        "question": " Do you, Dionysodorus, maintain that there is not?\n",
        "answer": "You will never prove to me, he said, that you have heard any one contradicting any one else."
    },
    {
        "context": "Indeed, said Ctesippus; then now you may hear me contradicting Dionysodorus.",
        "question": "\nAre you prepared to make that good?\n",
        "answer": "Certainly, he said."
    },
    {
        "context": "Certainly, he said.",
        "question": "\nWell, have not all things words expressive of them?\n",
        "answer": "Yes."
    },
    {
        "context": "Yes.",
        "question": "\nOf their existence or of their non–existence?\n",
        "answer": "Of their existence."
    },
    {
        "context": "Yes, Ctesippus, and we just now proved, as you may remember, that no man could affirm a negative; for no one could affirm that which is not.\nAnd what does that signify? said Ctesippus; you and I may contradict all the same for that.\n\nWhen two persons describe the same thing, or two persons describe different things, or one person speaks and another is silent, there is no contradiction.\n\nBut can we contradict one another, said Dionysodorus, when both of us are describing the same thing?",
        "question": " Then we must surely be speaking the same thing?\n",
        "answer": "He assented."
    },
    {
        "context": "Or when neither of us is speaking of the same thing?",
        "question": " For then neither of us says a word about the thing at all?\n",
        "answer": "He granted that proposition also."
    },
    {
        "context": "But when I describe something and you describe another thing, or I say something and you say nothing—is there any contradiction?",
        "question": " How can he who speaks contradict him who speaks not?\n",
        "answer": "Socrates takes up the argument."
    },
    {
        "context": "The Sophists maintain that there is no such thing as falsehood or false opinion, or ignorance or the refutation of ignorance.\n\nHere Ctesippus was silent; and I in my astonishment said: What do you mean, Dionysodorus? I have often heard, and have been amazed to hear, this thesis of yours, which is maintained and employed by the disciples of Protagoras, and others before them, and which to me appears to be quite wonderful, and suicidal as well as destructive, and I think that I am most likely to hear the truth about it from you. The dictum is that there is no such thing as falsehood; a man must either say what is true or say nothing.",
        "question": " Is not that your position?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nBut if he cannot speak falsely, may he not think falsely?\n",
        "answer": "No, he cannot, he said."
    },
    {
        "context": "No, he cannot, he said.",
        "question": "\nThen there is no such thing as false opinion?\n",
        "answer": "No, he said."
    },
    {
        "context": "Then there is no such thing as ignorance, or men who are ignorant;",
        "question": " for is not ignorance, if there be such a thing, a mistake of fact?\n",
        "answer": "Certainly, he said."
    },
    {
        "context": "Certainly, he said.",
        "question": "\nAnd that is impossible?\n",
        "answer": "Impossible, he replied."
    },
    {
        "context": "Are you saying this as a paradox, Dionysodorus;",
        "question": " or do you seriously maintain no man to be ignorant?\n",
        "answer": "Refute me, he said."
    },
    {
        "context": "Refute me, he said.",
        "question": "\nBut how can I refute you, if, as you say, to tell a falsehood is impossible?\n",
        "answer": "Very true, said Euthydemus."
    },
    {
        "context": "Neither did I tell you just now to refute me, said Dionysodorus;",
        "question": " for how can I tell you to do that which is not?\n",
        "answer": "O Euthydemus, I said, I have but a dull conception of these subtleties and excellent devices of wisdom;"
    },
    {
        "context": "O Euthydemus, I said, I have but a dull conception of these subtleties and excellent devices of wisdom;",
        "question": " I am afraid that I hardly understand them, and you must forgive me therefore if I ask a very stupid question: if there be no falsehood or false opinion or ignorance, there can be no such thing as erroneous action, for a man cannot fail of acting as he is acting—that is what you mean?\n",
        "answer": "Yes, he replied."
    },
    {
        "context": "And now, I said, I will ask my stupid question: If there is no such thing as error in deed, word, or thought, then what, in the name of goodness, do you come hither to teach?",
        "question": " And were you not just now saying that you could teach virtue best of all men, to any one who was willing to learn?\n",
        "answer": "The Sophists are above consistency and all that sort of thing."
    },
    {
        "context": "The Sophists are above consistency and all that sort of thing.",
        "question": "\n\nAnd are you such an old fool, Socrates, rejoined Dionysodorus, that you bring up now what I said at first—and if I had said anything last year, I suppose that you would bring that up too—but are non–plussed at the words which I have just uttered?\n",
        "answer": "Why, I said, they are not easy to answer; for they are the words of wise men: and indeed I know not what to make of this word ‘non–plussed,’ which you used last: what do you mean by it, Dionysodorus? You must mean that I cannot refute your argument. Tell me if the words have any other sense."
    },
    {
        "context": "No, he replied, they mean what you say. And now answer.\nWhat, before you, Dionysodorus? I said.\nAnswer, said he.",
        "question": "\nAnd is that fair?\n",
        "answer": "Yes, quite fair, he said."
    },
    {
        "context": "Upon what principle? I said. I can only suppose that you are a very wise man who comes to us in the character of a great logician, and who knows when to answer and when not to answer—and now you will not open your mouth at all, because you know that you ought not.\nYou prate, he said, instead of answering. But if, my good sir, you admit that I am wise, answer as I tell you.\n\nYou ask me, Socrates, what sense my words have?",
        "question": " Things which have sense are alive:—are my words alive?\n",
        "answer": "I suppose that I must obey, for you are master. Put the question."
    },
    {
        "context": "I suppose that I must obey, for you are master. Put the question.",
        "question": "\nAre the things which have sense alive or lifeless?\n",
        "answer": "They are alive."
    },
    {
        "context": "They are alive.",
        "question": "\nAnd do you know of any word which is alive?\n",
        "answer": "I cannot say that I do."
    },
    {
        "context": "I cannot say that I do.",
        "question": "\nThen why did you ask me what sense my words had?\n",
        "answer": "Socrates retorts upon the Sophists their own statement that error cannot be refuted."
    },
    {
        "context": "\nWhy, because I was stupid and made a mistake. And yet, perhaps, I was right after all in saying that words have a sense;—what do you say, wise man? If I was not in error, even you will not refute me, and all your wisdom will be non–plussed; but if I did fall into error, then again you are wrong in saying that there is no error,—and this remark was made by you not quite a year ago. I am inclined to think, however, Dionysodorus and Euthydemus, that this argument lies where it was and is not very likely to advance: even your skill in the subtleties of logic, which is really amazing, has not found out the way of throwing another and not falling yourself, now any more than of old.\n\nHigh words.\n\nCtesippus said: Men of Chios, Thurii, or however and whatever you call yourselves, I wonder at you, for you seem to have no objection to talking nonsense.\n\nSocrates again tries to pour oil upon the waters.\n\nFearing that there would be high words, I again endeavoured to, soothe Ctesippus, and said to him: To you, Ctesippus, I must repeat what I said before to Cleinias—that you do not understand the ways of these philosophers from abroad. They are not serious, but, like the Egyptian wizard, Proteus, they take different forms and deceive us by their enchantments: and let us, like Menelaus, refuse to let them go until they show themselves to us in earnest. When they begin to be in earnest their full beauty will appear: let us then beg and entreat and beseech them to shine forth. And I think that I had better once more exhibit the form in which I pray to behold them; it might be a guide to them. I will go on therefore where I left off, as well as I can, in the hope that I may touch their hearts and move them to pity, and that when they see me deeply serious and interested, they also may be serious. You, Cleinias, I said, shall remind me at what point we left off. Did we not agree that philosophy should be studied?",
        "question": " and was not that our conclusion?\n",
        "answer": "Yes, he replied."
    },
    {
        "context": "Yes, he replied.",
        "question": "\nAnd philosophy is the acquisition of knowledge?\n",
        "answer": "Yes, he said."
    },
    {
        "context": "And what knowledge ought we to acquire?",
        "question": " May we not answer with absolute truth—A knowledge which will do us good?\n",
        "answer": "Certainly, he said."
    },
    {
        "context": "Certainly, he said.",
        "question": "\nAnd should we be any the better if we went about having a knowledge of the places where most gold was hidden in the earth?\n",
        "answer": "Perhaps we should, he said."
    },
    {
        "context": "\nThe old argument resumed.\n\nBut have we not already proved, I said, that we should be none the better off, even if without trouble and digging all the gold which there is in the earth were ours? And if we knew how to convert stones into gold, the knowledge would be of no value to us, unless we also knew how to use the gold? Do you not remember? I said.\nI quite remember, he said.\nNor would any other knowledge, whether of money–making, or of medicine, or of any other art which knows only how to make a thing, and not to use it when made, be of any good to us.",
        "question": " Am I not right?\n",
        "answer": "He agreed."
    },
    {
        "context": "He agreed.",
        "question": "\nAnd if there were a knowledge which was able to make men immortal, without giving them the knowledge of the way to use the immortality, neither would there be any use in that, if we may argue from the analogy of the previous instances?\n",
        "answer": "To all this he agreed."
    },
    {
        "context": "To all this he agreed.",
        "question": "\nThen, my dear boy, I said, the knowledge which we want is one that uses as well as makes?\n",
        "answer": "True, he said."
    },
    {
        "context": "\nThe knowledge which makes is not to be separated from the knowledge which uses.\n\nAnd our desire is not to be skilful lyre–makers, or artists of that sort—far otherwise; for with them the art which makes is one, and the art which uses is another. Although they have to do with the same, they are divided: for the art which makes and the art which plays on the lyre differ widely from one another.",
        "question": " Am I not right?\n",
        "answer": "He agreed."
    },
    {
        "context": "And clearly we do not want the art of the flute–maker;",
        "question": " this is only another of the same sort?\n",
        "answer": "He assented."
    },
    {
        "context": "He assented.",
        "question": "\nBut suppose, I said, that we were to learn the art of making speeches—would that be the art which would make us happy?\n",
        "answer": "I should say, no, rejoined Cleinias."
    },
    {
        "context": "And why should you say so? I asked.\nI see, he replied, that there are some composers of speeches who do not know how to use the speeches which they make, just as the makers of lyres do not know how to use the lyres; and also some who are of themselves unable to compose speeches, but are able to use the speeches which the others make for them; and this proves that the art of making speeches is not the same as the art of using them.\n\nThe sophistical art is a part of the greater art of enchantment.\n\nYes, I said; and I take your words to be a sufficient proof that the art of making speeches is not one which will make a man happy. And yet I did think that the art which we have so long been seeking might be discovered in that direction; for the composers of speeches, whenever I meet them, always appear to me to be very extraordinary men, Cleinias, and their art is lofty and divine, and no wonder. For their art is a part of the great art of enchantment, and hardly, if at all, inferior to it: and whereas the art of the enchanter is a mode of charming snakes and spiders and scorpions, and other monsters and pests, this art of their’s acts upon dicasts and ecclesiasts and bodies of men, for the charming and pacifying of them.",
        "question": " Do you agree with me?\n",
        "answer": "Yes, he said, I think that you are quite right."
    },
    {
        "context": "Yes, he said, I think that you are quite right.",
        "question": "\nWhither then shall we go, I said, and to what art shall we have recourse?\n",
        "answer": "I do not see my way, he said."
    },
    {
        "context": "But I think that I do, I replied.\nAnd what is your notion? asked Cleinias.\nI think that the art of the general is above all others the one of which the possession is most likely to make a man happy.\nI do not think so, he said.\nWhy not? I said.\nThe art of the general is surely an art of hunting mankind.\nWhat of that? I said.\n\nCleinias of his own accord declares that the art of the general is not the one most likely to make men happy, because, like the huntsman, he can only take and not use the prey.\n\nWhy, he said, no art of hunting extends beyond hunting and capturing; and when the prey is taken the huntsman or fisherman cannot use it; but they hand it over to the cook, and the geometricians and astronomers and calculators (who all belong to the hunting class, for they do not make their diagrams, but only find out that which was previously contained in them)—they, I say, not being able to use but only to catch their prey, hand over their inventions to the dialectician to be applied by him, if they have any sense in them.\nGood, I said, fairest and wisest Cleinias.",
        "question": " And is this true?\n",
        "answer": "Certainly, he said; just as a general when he takes a city or a camp hands over his new acquisition to the statesman, for he does not know how to use them himself; or as the quail–taker transfers the quails to the keeper of them. If we are looking for the art which is to make us blessed, and which is able to use that which it makes or takes, the art of the general is not the one, and some other must be found."
    },
    {
        "context": "\n\nCri.\n\nCrito suspects that neither Cleinias nor Ctesippus is the author of this observation, but some one far superior to either of them.",
        "question": "\n\nAnd do you mean, Socrates, that the youngster said all this?\n",
        "answer": "Soc."
    },
    {
        "context": "Soc.",
        "question": "\nAre you incredulous, Crito?\n",
        "answer": "Cri."
    },
    {
        "context": "Indeed, I am; for if he did say so, then in my opinion he needs neither Euthydemus nor any one else to be his instructor.\n\n\nSoc.\nPerhaps I may have forgotten, and Ctesippus was the real answerer.\n\n\nCri.\nCtesippus! nonsense.\n\n\nSoc.\nAll I know is that I heard these words, and that they were not spoken either by Euthydemus or Dionysodorus. I dare say, my good Crito, that they may have been spoken by some superior person: that I heard them I am certain.\n\n\nCri.\nYes, indeed, Socrates, by some one a good deal superior, as I should be disposed to think.",
        "question": " But did you carry the search any further, and did you find the art which you were seeking?\n",
        "answer": "Soc."
    },
    {
        "context": "Find! my dear sir, no indeed. And we cut a poor figure; we were like children after larks, always on the point of catching the art, which was always getting away from us. But why should I repeat the whole story? At last we came to the kingly art, and enquired whether that gave and caused happiness, and then we got into a labyrinth, and when we thought we were at the end, came out again at the beginning, having still to seek as much as ever.\n\n\nCri.",
        "question": "\nHow did that happen, Socrates?\n",
        "answer": "Soc."
    },
    {
        "context": "I will tell you; the kingly art was identified by us with the political.\n\n\nCri.",
        "question": "\nWell, and what came of that?\n",
        "answer": "Soc."
    },
    {
        "context": "\nPursuing the enquiry, we found that the royal or political art was the only one which knew how the other arts were to be used.\n\nTo this royal or political art all the arts, including the art of the general, seemed to render up the supremacy, that being the only one which knew how to use what they produce. Here obviously was the very art which we were seeking—the art which is the source of good government, and which may be described, in the language of Aeschylus, as alone sitting at the helm of the vessel of state, piloting and governing all things, and utilizing them.\n\n\nCri.",
        "question": "\nAnd were you not right, Socrates?\n",
        "answer": "Soc."
    },
    {
        "context": "You shall judge, Crito, if you are willing to hear what followed; for we resumed the enquiry, and a question of this sort was asked: Does the kingly art, having this supreme authority, do anything for us? To be sure, was the answer.",
        "question": " And would not you, Crito, say the same?\n",
        "answer": "Cri."
    },
    {
        "context": "Yes, I should.\n\n\nSoc.\nAnd what would you say that the kingly art does?",
        "question": " If medicine were supposed to have supreme authority over the subordinate arts, and I were to ask you a similar question about that, you would say—it produces health?\n",
        "answer": "Cri."
    },
    {
        "context": "I should.\n\n\nSoc.\nAnd what of your own art of husbandry, supposing that to have supreme authority over the subject arts—what does that do?",
        "question": " Does it not supply us with the fruits of the earth?\n",
        "answer": "Cri."
    },
    {
        "context": "Yes.\n\n\nSoc.\n\nSuch an art ought to make us useful, and, if wisdom is the most useful of all things, should impart wisdom to us.\n\nAnd what does the kingly art do when invested with supreme power?",
        "question": " Perhaps you may not be ready with an answer?\n",
        "answer": "Cri."
    },
    {
        "context": "Indeed I am not, Socrates.\n\n\nSoc.\nNo more were we, Crito. But at any rate you know that if this is the art which we were seeking, it ought to be useful.\n\n\nCri.\nCertainly.\n\n\nSoc.",
        "question": "\nAnd surely it ought to do us some good?\n",
        "answer": "Cri."
    },
    {
        "context": "Certainly, Socrates.\n\n\nSoc.\nAnd Cleinias and I had arrived at the conclusion that knowledge of some kind is the only good.\n\n\nCri.\nYes, that was what you were saying.\n\n\nSoc.\nAll the other results of politics, and they are many, as for example, wealth, freedom, tranquillity, were neither good nor evil in themselves; but the political science ought to make us wise, and impart knowledge to us, if that is the science which is likely to do us good, and make us happy.\n\n\nCri.\nYes; that was the conclusion at which you had arrived, according to your report of the conversation.\n\n\nSoc.",
        "question": "\nAnd does the kingly art make men wise and good?\n",
        "answer": "Cri."
    },
    {
        "context": "Cri.",
        "question": "\nWhy not, Socrates?\n",
        "answer": "Soc."
    },
    {
        "context": "What, all men, and in every respect?",
        "question": " and teach them all the arts,—carpentering, and cobbling, and the rest of them?\n",
        "answer": "Cri."
    },
    {
        "context": "I think not, Socrates.\n\n\nSoc.",
        "question": "\n\nWhat is this superior knowledge?\n",
        "answer": "But then what is this knowledge, and what are we to do with it? For it is not the source of any works which are neither good nor evil, and gives no knowledge, but the knowledge of itself; what then can it be, and what are we to do with it?"
    },
    {
        "context": "But then what is this knowledge, and what are we to do with it? For it is not the source of any works which are neither good nor evil, and gives no knowledge, but the knowledge of itself; what then can it be, and what are we to do with it?",
        "question": " Shall we say, Crito, that it is the knowledge by which we are to make other men good?\n",
        "answer": "Cri."
    },
    {
        "context": "By all means.\n\n\nSoc.\nAnd in what will they be good and useful? Shall we repeat that they will make others good, and that these others will make others again, without ever determining in what they are to be good; for we have put aside the results of politics, as they are called. This is the old, old song over again; and we are just as far as ever, if not farther, from the knowledge of the art or science of happiness.\n\n\nCri.\nIndeed, Socrates, you do appear to have got into a great perplexity.\n\n\nSoc.\n\nSocrates in perplexity turns to the two Sophists for an answer.\n\nThereupon, Crito, seeing that I was on the point of shipwreck, I lifted up my voice, and earnestly entreated and called upon the strangers to save me and the youth from the whirlpool of the argument; they were our Castor and Pollux, I said, and they should be serious, and show us in sober earnest what that knowledge was which would enable us to pass the rest of our lives in happiness.\n\n\nCri.",
        "question": "\nAnd did Euthydemus show you this knowledge?\n",
        "answer": "Soc."
    },
    {
        "context": "Yes, indeed;",
        "question": " he proceeded in a lofty strain to the following effect: Would you rather, Socrates, said he, that I should show you this knowledge about which you have been doubting, or shall I prove that you already have it?\n",
        "answer": "Indeed I am."
    },
    {
        "context": "Then I would much rather that you should prove me to have such a knowledge; at my time of life that will be more agreeable than having to learn.",
        "question": "What, I said, are you blessed with such a power as this?\n",
        "answer": "Socrates admits that he knows something and does not know other things."
    },
    {
        "context": "\nYes, I said, I know many things, but not anything of much importance.",
        "question": "\nThen tell me, he said, do you know anything?\n",
        "answer": "Certainly not."
    },
    {
        "context": "Certainly not.",
        "question": "\nThat will do, he said: And would you admit that anything is what it is, and at the same time is not what it is?\n",
        "answer": "I did."
    },
    {
        "context": "If you know, you are knowing.\nCertainly, of the knowledge which I have.\nThat makes no difference;",
        "question": "\nAnd did you not say that you knew something?\n",
        "answer": "Certainly not, I said, for there are many other things which I do not know."
    },
    {
        "context": "And if you do not know, you are not knowing.\nYes, friend, of that which I do not know.\n\nBut if so, he knows and does not know at the same time.\n\nStill you are not knowing, and you said just now that you were knowing; and therefore you are and are not at the same time, and in reference to the same things.\nA pretty clatter, as men say, Euthydemus, this of yours! and will you explain how I possess that knowledge for which we were seeking? Do you mean to say that the same thing cannot be and also not be;",
        "question": "—and must you not, if you are knowing, know all things?\n",
        "answer": "Out of your own mouth, Socrates, you are convicted, he said."
    },
    {
        "context": "Well, but, Euthydemus, I said, has that never happened to you? for if I am only in the same case with you and our beloved Dionysodorus, I cannot complain.",
        "question": " and therefore, since I know one thing, that I know all, for I cannot be knowing and not knowing at the same time, and if I know all things, then I must have the knowledge for which we are seeking—May I assume this to be your ingenious notion?\n",
        "answer": "Certainly not, Socrates, said Dionysodorus."
    },
    {
        "context": "What do you mean, I said;",
        "question": " Tell me, then, you two, do you not know some things, and not know others?\n",
        "answer": "Nay, he replied, we do know something."
    },
    {
        "context": "Nay, he replied, we do know something.",
        "question": " do you know nothing?\n",
        "answer": "Yes, all things, he said; and that is as true of you as of us."
    },
    {
        "context": "\nBut this is impossible; and therefore if he knows, he knows all things.\n\nO, indeed, I said, what a wonderful thing, and what a great blessing!",
        "question": "\nThen, I said, you know all things, if you know anything?\n",
        "answer": "Certainly, he replied; they cannot know some things, and not know others, and be at the same time knowing and not knowing."
    },
    {
        "context": "Then what is the inference? I said.\nThey all know all things, he replied, if they know one thing.\nO heavens, Dionysodorus, I said, I see now that you are in earnest; hardly have I got you to that point.",
        "question": " And do all other men know all things or nothing?\n",
        "answer": "Certainly, he said."
    },
    {
        "context": "Certainly, he said.",
        "question": " And do you really and truly know all things, including carpentering and leather–cutting?\n",
        "answer": "Yes, by the gods, we do, and cobbling, too."
    },
    {
        "context": "Yes, by the gods, we do, and cobbling, too.",
        "question": "\nAnd do you know stitching?\n",
        "answer": "Certainly;"
    },
    {
        "context": "Certainly;",
        "question": "\nAnd do you know things such as the numbers of the stars and of the sand?\n",
        "answer": "Ctesippus requires a proof of their universal knowledge. They shall tell him the number of one another’s teeth, and he will count them."
    },
    {
        "context": "\nBy Zeus, said Ctesippus, interrupting, I only wish that you would give me some proof which would enable me to know whether you speak truly.\nWhat proof shall I give you? he said.\nWill you tell me how many teeth Euthydemus has? and Euthydemus shall tell how many teeth you have.",
        "question": " did you think we should say No to that?\n",
        "answer": "Certainly not, said Ctesippus: you must further tell us this one thing, and then we shall know that you are speaking the truth; if you tell us the number, and we count them, and you are found to be right, we will believe the rest. They fancied that Ctesippus was making game of them, and they refused, and they would only say, in answer to each of his questions, that they knew all things. For at last Ctesippus began to throw off all restraint; no question in fact was too bad for him; he would ask them if they knew the foulest things, and they, like wild boars, came rushing on his blows, and fearlessly replied that they did. At last, Crito, I too was carried away by my incredulity, and asked Euthydemus whether Dionysodorus could dance."
    },
    {
        "context": "Certainly, he replied.\nAnd can he vault among swords, and turn upon a wheel, at his age?",
        "question": "\nWill you not take our word that we know all things?\n",
        "answer": "He can do anything, he said."
    },
    {
        "context": "He can do anything, he said.",
        "question": " has he got to such a height of skill as that?\n",
        "answer": "Always, he said."
    },
    {
        "context": "Always, he said.",
        "question": "\nAnd did you always know this?\n",
        "answer": "They both said that they did."
    },
    {
        "context": "This we could not believe. And Euthydemus said: You are incredulous, Socrates.\nYes, I said, and I might well be incredulous, if I did not know you to be wise men.\nBut if you will answer, he said, I will make you confess to similar marvels.\n\nSocrates would like to be self–convicted of wisdom.\n\nWell, I said, there is nothing that I should like better than to be self–convicted of this, for if I am really a wise man, which I never knew before, and you will prove to me that I know and have always known all things, nothing in life would be a greater gain to me.\nAnswer then, he said.\nAsk, I said, and I will answer.",
        "question": "\nWhen you were children, and at your birth?\n",
        "answer": "Something, I said."
    },
    {
        "context": "Something, I said.",
        "question": "\nDo you know something, Socrates, or nothing?\n",
        "answer": "With what I know;"
    },
    {
        "context": "With what I know;",
        "question": "\nAnd do you know with what you know, or with something else?\n",
        "answer": "Well, I said; but then what am I to do? for I will do whatever you bid; when I do not know what you are asking, you tell me to answer nevertheless, and not to ask again."
    },
    {
        "context": "Why, you surely have some notion of my meaning, he said.\nYes, I replied.\nWell, then, answer according to your notion of my meaning.\nYes, I said;",
        "question": " and I suppose that you mean with my soul?\n",
        "answer": "That will please me very well; but will not please you equally well, as I imagine."
    },
    {
        "context": "I certainly will not answer unless I understand you, I said.\nYou will not answer, he said, according to your view of the meaning, because you will be prating, and are an ancient.\n\nSocrates will not quarrel with the two Sophists; for he desires to become their pupil.\n\nNow I saw that he was getting angry with me for drawing distinctions, when he wanted to catch me in his springes of words. And I remembered that Connus was always angry with me when I opposed him, and then he neglected me, because he thought that I was stupid; and as I was intending to go to Euthydemus as a pupil, I reflected that I had better let him have his way, as he might think me a blockhead, and refuse to take me. So I said: You are a far better dialectician than myself, Euthydemus, for I have never made a profession of the art, and therefore do as you say; ask your questions once more, and I will answer.\nAnswer then, he said, again, whether you know what you know with something, or with nothing.\nYes, I said; I know with my soul.\nThe man will answer more than the question; for I did not ask you, he said, with what you know, but whether you know with something.\nAgain I replied, Through ignorance I have answered too much, but I hope that you will forgive me. And now I will answer simply that I always know what I know with something.",
        "question": "Are you not ashamed, Socrates, of asking a question when you are asked one?\n",
        "answer": "Always, I replied, when I know, I know with this."
    },
    {
        "context": "Always, I replied, when I know, I know with this.",
        "question": " but if the question which you ask in one sense is understood and answered by me in another, will that please you—if I answer what is not to the point?\n",
        "answer": "My fear is that this word ‘always’ may get us into trouble."
    },
    {
        "context": "You, perhaps, but certainly not us.",
        "question": "\nAnd is that something, he rejoined, always the same, or sometimes one thing, and sometimes another thing?\n",
        "answer": "Always; since I am required to withdraw the words ‘when I know."
    },
    {
        "context": "Always; since I am required to withdraw the words ‘when I know.",
        "question": "\nWill you not cease adding to your answers?\n",
        "answer": "All that I know, I replied, I know with this."
    },
    {
        "context": "There again, Socrates, he said, the addition is superfluous.\n\nSocrates is compelled to admit that he always knows all things with the same thing.\n\nWell, then, I said, I will take away the words ‘that I know.’\nNay, take nothing away; I desire no favours of you;",
        "question": " And now answer: Do you always know with this?\n",
        "answer": "Quite impossible."
    },
    {
        "context": "And now, he said, you may add on whatever you like, for you confess that you know all things.\nI suppose that is true, I said, if my qualification implied in the words ‘that I know’ is not allowed to stand; and so I do know all things.\nAnd have you not admitted that you always know all things with that which you know, whether you make the addition of ‘when you know them’ or not? for you have acknowledged that you have always and at once known all things, that is to say, when you were a child, and at your birth, and when you were growing up, and before you were born, and before the heaven and earth existed, you knew all things, if you always know them; and I swear that you shall always continue to know all things, if I am of the mind to make you.\nBut I hope that you will be of that mind, reverend Euthydemus, I said, if you are really speaking the truth, and yet I a little doubt your power to make good your words unless you have the help of your brother Dionysodorus; then you may do it. Tell me now, both of you, for although in the main I cannot doubt that I really do know all things, when I am told so by men of your prodigious wisdom—how can I say that I know such things, Euthydemus, as that the good are unjust;",
        "question": "’\nYou always know with this, or, always knowing, do you know some things with this, and some things with something else, or do you know all things with this?\n",
        "answer": "Certainly, you know that."
    },
    {
        "context": "Certainly, you know that.",
        "question": " but let me ask: Would you be able to know all things, if you did not know all things?\n",
        "answer": "That the good are not unjust."
    },
    {
        "context": "\nBut he does not know that the good are unjust; therefore.\n\n Quite true, I said; and that I have always known;",
        "question": " come, do I know that or not?\n",
        "answer": "Nowhere, said Dionysodorus."
    },
    {
        "context": "Then, I said, I do not know this.\nYou are ruining the argument, said Euthydemus to Dionysodorus; he will be proved not to know, and then after all he will be knowing and not knowing at the same time.\nDionysodorus blushed.\n\nthere are some things which he does not know.\n\nI turned to the other, and said, What do you think, Euthydemus?",
        "question": "\nWhat do I know?\n",
        "answer": "What, replied Dionysodorus in a moment;"
    },
    {
        "context": "What, replied Dionysodorus in a moment;",
        "question": " but the question is, where did I learn that the good are unjust?\n",
        "answer": "Dionysodorus reproved by his brother Sophist."
    },
    {
        "context": "\nThereupon I said, Please not to interrupt, my good friend, or prevent Euthydemus from proving to me that I know the good to be unjust; such a lesson you might at least allow me to learn.\nYou are running away, Socrates, said Dionysodorus, and refusing to answer.\n\nSocrates cannot fight against the pair any more than Heracles against the Hydra.\n\nNo wonder, I said, for I am not a match for one of you, and a fortiori I must run away from two. I am no Heracles; and even Heracles could not fight against the Hydra, who was a she–Sophist, and had the wit to shoot up many new heads when one of them was cut off; especially when he saw a second monster of a sea–crab, who was also a Sophist, and appeared to have newly arrived from a sea–voyage, bearing down upon him from the left, opening his mouth and biting. When the monster was growing troublesome he called Iolaus, his nephew, to his help, who ably succoured him; but if my Iolaus, who is my brother Patrocles [the statuary], were to come, he would only make a bad business worse.",
        "question": " Does not your omniscient brother appear to you to have made a mistake?\n",
        "answer": "I suppose that I had best answer you, Dionysodorus, I said, for you will insist on asking—that I pretty well know—out of envy, in order to prevent me from learning the wisdom of Euthydemus."
    },
    {
        "context": "Then answer me, he said.\n\nDisputes about the words nephew, brother, or father, as they are taken in an absolute or in a relative sense.\n\nWell then, I said, I can only reply that Iolaus was not my nephew at all, but the nephew of Heracles; and his father was not my brother Patrocles, but Iphicles, who has a name rather like his, and was the brother of Heracles.",
        "question": " am I the brother of Euthydemus?\n",
        "answer": "Yes, I said, he is my half–brother, the son of my mother, but not of my father."
    },
    {
        "context": "Then he is and is not your brother.\nNot by the same father, my good man, I said, for Chaeredemus was his father, and mine was Sophroniscus.",
        "question": "\nAnd now that you have delivered yourself of this strain, said Dionysodorus, will you inform me whether Iolaus was the nephew of Heracles any more than he is yours?\n",
        "answer": "Yes, I said; the former was my father, and the latter his."
    },
    {
        "context": "Then, he said, Chaeredemus is not a father.\nHe is not my father, I said.\nBut can a father be other than a father?",
        "question": "\nAnd is Patrocles, he said, your brother?\n",
        "answer": "I certainly do not think that I am a stone, I said, though I am afraid that you may prove me to be one."
    },
    {
        "context": "I certainly do not think that I am a stone, I said, though I am afraid that you may prove me to be one.",
        "question": "\nAnd was Sophroniscus a father, and Chaeredemus also?\n",
        "answer": "I am."
    },
    {
        "context": "And being other than a stone, you are not a stone;",
        "question": " or are you the same as a stone?\n",
        "answer": "Very true."
    },
    {
        "context": "Very true.",
        "question": "\nAre you not other than a stone?\n",
        "answer": "I suppose that he is not a father, I replied."
    },
    {
        "context": "For if, said Euthydemus, taking up the argument, Chaeredemus is a father, then Sophroniscus, being other than a father, is not a father; and you, Socrates, are without a father.",
        "question": " and being other than gold, you are not gold?\n",
        "answer": "Assuredly not, said Euthydemus."
    },
    {
        "context": "Assuredly not, said Euthydemus.",
        "question": "\nAnd so Chaeredemus, he said, being other than a father, is not a father?\n",
        "answer": "He is the same."
    },
    {
        "context": "\nThe father of Euthydemus is declared to be the father of all, and not only of all men, but of all animals.\n\nI cannot say that I like the connection;",
        "question": "\nCtesippus, here taking up the argument, said: And is not your father in the same case, for he is other than my father?\n",
        "answer": "Of all other men, he replied."
    },
    {
        "context": "Of all other men, he replied.",
        "question": "\nThen he is the same?\n",
        "answer": "Certainly, I did so imagine, said Ctesippus."
    },
    {
        "context": "Certainly, I did so imagine, said Ctesippus.",
        "question": " but is he only my father, Euthydemus, or is he the father of all other men?\n",
        "answer": "They are not ‘in pari materia,’ Euthydemus, said Ctesippus, and you had better take care, for it is monstrous to suppose that your father is the father of all."
    },
    {
        "context": "But he is, he replied.",
        "question": " Do you suppose the same person to be a father and not a father?\n",
        "answer": "Of all, he said."
    },
    {
        "context": "Of all, he said.",
        "question": "\nAnd do you suppose that gold is not gold, or that a man is not a man?\n",
        "answer": "Yes, our mother too."
    },
    {
        "context": "Yes;",
        "question": "\nWhat, of men only, said Ctesippus, or of horses and of all other animals?\n",
        "answer": "Yes; and yours, he said."
    },
    {
        "context": "Yes; and yours, he said.",
        "question": "\nAnd your mother, too, is the mother of all?\n",
        "answer": "And yours too."
    },
    {
        "context": "And yours too.",
        "question": " and your mother has a progeny of sea–urchins then?\n",
        "answer": "And so is yours, he said."
    },
    {
        "context": "\nProceeding in the same line of argument, Dionysodorus declares that a dog who has puppies is a father, and that he who beats his dog beats his own father.\n\nIf you will answer my questions, said Dionysodorus, I will soon extract the same admissions from you, Ctesippus. You say that you have a dog.\nYes, a villain of a one, said Ctesippus.",
        "question": "\nAnd gudgeons and puppies and pigs are your brothers?\n",
        "answer": "Yes, and they are very like himself."
    },
    {
        "context": "Yes, and they are very like himself.",
        "question": "\nAnd your papa is a dog?\n",
        "answer": "Yes, he said, I certainly saw him and the mother of the puppies come together."
    },
    {
        "context": "Yes, he said, I certainly saw him and the mother of the puppies come together.",
        "question": "\nAnd he has puppies?\n",
        "answer": "To be sure he is."
    },
    {
        "context": "Then he is a father, and he is yours; ergo, he is your father, and the puppies are your brothers.",
        "question": "\nAnd the dog is the father of them?\n",
        "answer": "Ctesippus said, laughing, Indeed I do; and I only wish that I could beat you instead of him."
    },
    {
        "context": "Then you beat your father, he said.\nI should have far more reason to beat yours, said Ctesippus; what could he have been thinking of when he begat such wise sons? much good has this father of you and your brethren the puppies got out of this wisdom of yours.\nBut neither he nor you, Ctesippus, have any need of much good.\nAnd have you no need, Euthydemus? he said.\nNeither I nor any other man; for tell me now, Ctesippus, if you think it good or evil for a man who is sick to drink medicine when he wants it; or to go to war armed rather than unarmed.\nGood, I say. And yet I know that I am going to be caught in one of your charming puzzles.\n\nWhen a thing is good, you cannot have too much of it.\n\nThat, he replied, you will discover, if you answer; since you admit medicine to be good for a man to drink, when wanted, must it not be good for him to drink as much as possible;",
        "question": "\nAnd is he not yours?\n",
        "answer": "Ctesippus said: Quite so, Euthydemus, that is to say, if he who drinks is as big as the statue of Delphi."
    },
    {
        "context": "Ctesippus said: Quite so, Euthydemus, that is to say, if he who drinks is as big as the statue of Delphi.",
        "question": "\nLet me ask you one little question more, said Dionysodorus, quickly interposing, in order that Ctesippus might not get in his word: You beat this dog?\n",
        "answer": "Very true, said Ctesippus;"
    },
    {
        "context": "Very true, said Ctesippus;",
        "question": " when he takes his medicine, a cartload of hellebore will not be too much for him?\n",
        "answer": "I do."
    },
    {
        "context": "And would you arm Geryon and Briareus in that way? Considering that you and your companion fight in armour, I thought that you would have known better. . . .",
        "question": "\nAnd seeing that in war to have arms is a good thing, he ought to have as many spears and shields as possible?\n",
        "answer": "Yes, said Ctesippus, and the more the better."
    },
    {
        "context": "Yes, said Ctesippus, and the more the better.",
        "question": " and do you think, Euthydemus, that he ought to have one shield only, and one spear?\n",
        "answer": "Certainly, a great good, he said."
    },
    {
        "context": "Certainly, a great good, he said.",
        "question": " Here Euthydemus held his peace, but Dionysodorus returned to the previous answer of Ctesippus and said:—\nDo you not think that the possession of gold is a good thing?\n",
        "answer": "Certainly, he replied."
    },
    {
        "context": "Certainly, he replied.",
        "question": "\nAnd to have money everywhere and always is a good?\n",
        "answer": "Yes, Euthydemus, said Ctesippus; and the Scythians reckon those who have gold in their own skulls to be the happiest and bravest of men (that is only another instance of your manner of speaking about the dog and father), and what is still more extraordinary, they drink out of their own skulls gilt, and see the inside of them, and hold their own head in their hands."
    },
    {
        "context": "And do the Scythians and others see that which has the quality of vision, or that which has not? said Euthydemus.\nThat which has the quality of vision clearly.\n\nYou see that which has the quality of vision; you see our garments; therefore they have the quality of vision.\n\nAnd1 you also see that which has the quality of vision? he said.\nYes, I do.",
        "question": "\nAnd you admit gold to be a good?\n",
        "answer": "Yes."
    },
    {
        "context": "Then our garments have the quality of vision.\nThey can see to any extent, said Ctesippus.",
        "question": "\nAnd ought not a man then to have gold everywhere and always, and as much as possible in himself, and may he not be deemed the happiest of men who has three talents of gold in his belly, and a talent in his pate, and a stater of gold in either eye?\n",
        "answer": "Nothing; but you, my sweet man, may perhaps imagine that they do not see; and certainly, Euthydemus, you do seem to me to have been caught napping when you were not asleep, and that if it be possible to speak and say nothing—you are doing so."
    },
    {
        "context": "And may there not be a silence of the speaker? said Dionysodorus.\nImpossible, said Ctesippus.",
        "question": "\nThen do you see our garments?\n",
        "answer": "That is still more impossible, he said."
    },
    {
        "context": "That is still more impossible, he said.",
        "question": "\nWhat can they see?\n",
        "answer": "A similar double entendre."
    },
    {
        "context": "\nNot when I pass a smithy; for then the iron bars make a tremendous noise and outcry if they are touched: so that here your wisdom is strangely mistaken; please, however, to tell me how you can be silent when speaking (I thought that Ctesippus was put upon his mettle because Cleinias was present).",
        "question": "\nOr a speaking of the silent?\n",
        "answer": "Yes, he said."
    },
    {
        "context": "\nThe speaker may be silent or may speak, or both.\n\nBut if speaking things are included in all things, then the speaking are silent.\nWhat, said Ctesippus;",
        "question": "\nBut when you speak of stones, wood, iron bars, do you not speak of the silent?\n",
        "answer": "Certainly not, said Euthydemus."
    },
    {
        "context": "Certainly not, said Euthydemus.",
        "question": "\nWhen you are silent, said Euthydemus, is there not a silence of all things?\n",
        "answer": "Yes; those which speak."
    },
    {
        "context": "Yes; those which speak.",
        "question": " then all things are not silent?\n",
        "answer": "Neither and both, said Dionysodorus, quickly interposing; I am sure that you will be ‘non–plussed’ at that answer."
    },
    {
        "context": "Here Ctesippus, as his manner was, burst into a roar of laughter; he said, That brother of yours, Euthydemus, has got into a dilemma; all is over with him. This delighted Cleinias, whose laughter made Ctesippus ten times as uproarious; but I cannot help thinking that the rogue must have picked up this answer from them; for there has been no wisdom like theirs in our time.",
        "question": "\nThen, my good friend, do they all speak?\n",
        "answer": "Yes, Dionysodorus, I replied, I have seen many."
    },
    {
        "context": "\nThe Sophist lightly touches upon the doctrine of ideas.",
        "question": "\nNay, said Ctesippus, but the question which I ask is whether all things are silent or speak?\n",
        "answer": "Now I was in a great quandary at having to answer this question, and I thought that I was rightly served for having opened my mouth at all: I said however, They are not the same as absolute beauty, but they have beauty present with each of them."
    },
    {
        "context": "Now I was in a great quandary at having to answer this question, and I thought that I was rightly served for having opened my mouth at all: I said however, They are not the same as absolute beauty, but they have beauty present with each of them.",
        "question": " Why do you laugh, Cleinias, I said, at such solemn and beautiful things?\n",
        "answer": "God forbid, I replied."
    },
    {
        "context": "God forbid, I replied.",
        "question": "Why, Socrates, said Dionysodorus, did you ever see a beautiful thing?\n",
        "answer": "Is that your difficulty? I said. For I was beginning to imitate their skill, on which my heart was set."
    },
    {
        "context": "Of course, he replied, I and all the world are in a difficulty about the non–existent.\nWhat do you mean, Dionysodorus? I said.",
        "question": "\n\n Were they other than the beautiful, or the same as the beautiful?\n",
        "answer": "That, he said, is as I please."
    },
    {
        "context": "That, he said, is as I please.",
        "question": "\nAnd are you an ox because an ox is present with you, or are you Dionysodorus, because Dionysodorus is present with you?\n",
        "answer": "Yes, he said."
    },
    {
        "context": "\nFresh quibbles.\n\nAnd you will admit that the same is the same, and the other other; for surely the other is not the same; I should imagine that even a child will hardly deny the other to be other. But I think, Dionysodorus, that you must have intentionally missed the last question; for in general you and your brother seem to me to be good workmen in your own department, and to do the dialectician’s business excellently well.\nWhat, said he, is the business of a good workman?",
        "question": "\nBut how, he said, by reason of one thing being present with another, will one thing be another?\n",
        "answer": "The smith’s."
    },
    {
        "context": "The smith’s.",
        "question": " Is not the honourable honourable and the base base?\n",
        "answer": "The potter’s."
    },
    {
        "context": "The potter’s.",
        "question": "\nAnd do you please?\n",
        "answer": "The cook, I said."
    },
    {
        "context": "The cook, I said.",
        "question": " tell me, in the first place, whose business is hammering?\n",
        "answer": "Certainly."
    },
    {
        "context": "And the business of the cook is to cut up and skin;",
        "question": "\nAnd whose the making of pots?\n",
        "answer": "Yes, I have admitted that, but you must not be too hard upon me."
    },
    {
        "context": "Then if some one were to kill, mince, boil, roast the cook, he would do his business, and if he were to hammer the smith, and make a pot of the potter, he would do their business.\nPoseidon, I said, this is the crown of wisdom;",
        "question": "\nAnd who has to kill and skin and mince and boil and roast?\n",
        "answer": "Certainly, I said, if you will allow me."
    },
    {
        "context": "Certainly, I said, if you will allow me.",
        "question": "\nAnd if a man does his business he does rightly?\n",
        "answer": "Yes, I do, subject to your correction; for you are the bottom, and Euthydemus is the top, of all my wisdom."
    },
    {
        "context": "\nThat which is your own you can give away or sell; e. g. the ox or sheep which you sacrifice.",
        "question": " you have admitted that?\n",
        "answer": "Yes, I said (for I was certain that something good would come out of the questions, which I was impatient to hear); yes, such things, and such things only are mine."
    },
    {
        "context": "Yes, I said (for I was certain that something good would come out of the questions, which I was impatient to hear); yes, such things, and such things only are mine.",
        "question": " can I ever hope to have such wisdom of my own?\n",
        "answer": "Yes, I said."
    },
    {
        "context": "Yes, I said.",
        "question": "And would you be able, Socrates, to recognize this wisdom when it has become your own?\n",
        "answer": "I agree."
    },
    {
        "context": "Then, after a pause, in which he seemed to be lost in the contemplation of something great, he said: Tell me, Socrates, have you an ancestral Zeus? Here, anticipating the final move, like a person caught in a net, who gives a desperate twist that he may get away, I said: No, Dionysodorus, I have not.\nWhat a miserable man you must be then, he said; you are not an Athenian at all if you have no ancestral gods or temples, or any other mark of gentility.\nNay, Dionysodorus, I said, do not be rough; good words, if you please; in the way of religion I have altars and temples, domestic and ancestral, and all that other Athenians have.",
        "question": "\nWhat, he said, do you think that you know what is your own?\n",
        "answer": "That name, I said, is not to be found among the Ionians, whether colonists or citizens of Athens; an ancestral Apollo there is, who is the father of Ion, and a family Zeus, and a Zeus guardian of the phratry, and an Athene guardian of the phratry. But the name of ancestral Zeus is unknown to us."
    },
    {
        "context": "No matter, said Dionysodorus, for you admit that you have Apollo, Zeus, and Athene.\nCertainly, I said.\nAnd they are your gods, he said.\nYes, I said, my lords and ancestors.",
        "question": "\n\nIs not that which you would deem your own, he said, that which you have in your own power, and which you are able to use as you would desire, for example, an ox or a sheep—would you not think that which you could sell and give and sacrifice to any god whom you pleased, to be your own, and that which you could not give or sell or sacrifice you would think not to be in your own power?\n",
        "answer": "I did, I said;"
    },
    {
        "context": "I did, I said;",
        "question": "\nYes, he said, and you would mean by animals living beings?\n",
        "answer": "And are not these gods animals? for you admit that all things which have life are animals;"
    },
    {
        "context": "And are not these gods animals? for you admit that all things which have life are animals;",
        "question": "\nYou agree then, that those animals only are yours with which you have the power to do all these things which I was just naming?\n",
        "answer": "They have life, I said."
    },
    {
        "context": "They have life, I said.",
        "question": "\nAnd have not other Athenians, he said, an ancestral Zeus?\n",
        "answer": "They are animals, I said."
    },
    {
        "context": "\nGods are animals; and if it is admitted that animals may be sold, then the gods may be sold.",
        "question": "\nAt any rate they are yours, he said, did you not admit that?\n",
        "answer": "I did admit that, Euthydemus, and I have no way of escape."
    },
    {
        "context": "I did admit that, Euthydemus, and I have no way of escape.",
        "question": " what is going to happen to me?\n",
        "answer": "At this I was quite struck dumb, Crito, and lay prostrate. Ctesippus came to the rescue."
    },
    {
        "context": "Bravo, Heracles, brave words, said he.\nBravo Heracles, or is Heracles a Bravo? said Dionysodorus.\nPoseidon, said Ctesippus, what awful distinctions. I will have no more of them; the pair are invincible.\nThen, my dear Crito, there was universal applause of the speakers and their words, and what with laughing and clapping of hands and rejoicings the two men were quite overpowered; for hitherto their partisans only had cheered at each successive hit, but now the whole company shouted with delight until the columns of the Lyceum returned the sound, seeming to sympathize in their joy. To such a pitch was I affected myself, that I made a speech, in which I acknowledged that I had never seen the like of their wisdom; I was their devoted servant, and fell to praising and admiring of them. What marvellous dexterity of wit, I said, enabled you to acquire this great perfection in such a short time? There is much, indeed, to admire in your words, Euthydemus and Dionysodorus, but there is nothing that I admire more than your magnanimous disregard of any opinion—whether of the many, or of the grave and reverend seigniors—you regard only those who are like yourselves. And I do verily believe that there are few who are like you, and who would approve of such arguments; the majority of mankind are so ignorant of their value, that they would be more ashamed of employing them in the refutation of others than of being refuted by them. I must further express my approval of your kind and public–spirited denial of all differences, whether of good and evil, white or black, or any other; the result of which is that, as you say, every mouth is sewn up, not excepting your own, which graciously follows the example of others; and thus all ground of offence is taken away. But what appears to me to be more than all is, that this art and invention of yours has been so admirably contrived by you, that in a very short time it can be imparted to any one. I observed that Ctesippus learned to imitate you in no time. Now this quickness of attainment is an excellent thing; but at the same time I would advise you not to have any more public entertainments; there is a danger that men may undervalue an art which they have so easy an opportunity of acquiring; the exhibition would be best of all, if the discussion were confined to your two selves; but if there must be an audience, let him only be present who is willing to pay a handsome fee;—you should be careful of this;—and if you are wise, you will also bid your disciples discourse with no man but you and themselves. For only what is rare is valuable; and ‘water,’ which, as Pindar says, is the ‘best of all things,’ is also the cheapest. And now I have only to request that you will receive Cleinias and me among your pupils.\nSuch was the discussion, Crito; and after a few more words had passed between us we went away. I hope that you will come to them with me, since they say that they are able to teach any one who will give them money; no age or want of capacity is an impediment. And I must repeat one thing which they said, for your especial benefit,—that the learning of their art did not at all interfere with the business of money–making.\n\n\nCri.\n\nCrito remonstrates with Socrates on the impropriety of entering into discussion with such men as the two Sophists;\nand confirms his opinion by that of an Athenian pleader.\n\nTruly, Socrates, though I am curious and ready to learn, yet I fear that I am not like–minded with Euthydemus, but one of the other sort, who, as you were saying, would rather be refuted by such arguments than use them in refutation of others. And though I may appear ridiculous in venturing to advise you, I think that you may as well hear what was said to me by a man of very considerable pretensions—he was a professor of legal oratory—who came away from you while I was walking up and down. ‘Crito,’ said he to me, ‘are you giving no attention to these wise men?’ ‘No, indeed,’ I said to him; ‘I could not get within hearing of them—there was such a crowd.’ ‘You would have heard something worth hearing if you had.’ ‘What was that?’ I said. ‘You would have heard the greatest masters of the art of rhetoric discoursing.’ ‘And what did you think of them?’ I said. ‘What did I think of them?’ he said:—‘theirs was the sort of discourse which anybody might hear from men who were playing the fool, and making much ado about nothing.’ That was the expression which he used. ‘Surely,’ I said, ‘philosophy is a charming thing.’ ‘Charming!’ he said; ‘what simplicity! philosophy is nought; and I think that if you had been present you would have been ashamed of your friend—his conduct was so very strange in placing himself at the mercy of men who care not what they say, and fasten upon every word. And these, as I was telling you, are supposed to be the most eminent professors of their time. But the truth is, Crito, that the study itself and the men themselves are utterly mean and ridiculous.’ Now censure of the pursuit, Socrates, whether coming from him or from others, appears to me to be undeserved; but as to the impropriety of holding a public discussion with such men, there, I confess that, in my opinion, he was in the right.\n\nSoc.\nO Crito, they are marvellous men; but what was I going to say? First of all let me know;—What manner of man was he who came up to you and censured philosophy;",
        "question": " and have not these gods life?\n",
        "answer": "Cri."
    },
    {
        "context": "He was certainly not an orator, and I doubt whether he had ever been into court; but they say that he knows the business, and is a clever man, and composes wonderful speeches.\n\n\nSoc.\n\nSocrates in return disparages Crito’s informant. He belongs to a hybrid class, who are a cross between philosophers and politicians, and inferior to either.\n\nNow I understand, Crito; he is one of an amphibious class, whom I was on the point of mentioning—one of those whom Prodicus describes as on the border–ground between philosophers and statesmen—they think that they are the wisest of all men, and that they are generally esteemed the wisest; nothing but the rivalry of the philosophers stands in their way; and they are of the opinion that if they can prove the philosophers to be good for nothing, no one will dispute their title to the palm of wisdom, for that they are themselves really the wisest, although they are apt to be mauled by Euthydemus and his friends, when they get hold of them in conversation. This opinion which they entertain of their own wisdom is very natural; for they have a certain amount of philosophy, and a certain amount of political wisdom; there is reason in what they say, for they argue that they have just enough of both, and so they keep out of the way of all risks and conflicts and reap the fruits of their wisdom.\n\n\nCri.\nWhat do you say of them, Socrates? There is certainly something specious in that notion of theirs.\n\n\nSoc.\nYes, Crito, there is more speciousness than truth; they cannot be made to understand the nature of intermediates. For all persons or things, which are intermediate between two other things, and participate in both of them—if one of these two things is good and the other evil, are better than the one and worse than the other; but if they are in a mean between two good things which do not tend to the same end, they fall short of either of their component elements in the attainment of their ends. Only in the case when the two component elements which do not tend to the same end are evil is the participant better than either. Now, if philosophy and political action are both good, but tend to different ends, and they participate in both, and are in a mean between them, then they are talking nonsense, for they are worse than either; or, if the one be good and the other evil, they are better than the one and worse than the other; only on the supposition that they are both evil could there be any truth in what they say. I do not think that they will admit that their two pursuits are either wholly or partly evil; but the truth is, that these philosopher–politicians who aim at both fall short of both in the attainment of their respective ends, and are really third, although they would like to stand first. There is no need, however, to be angry at this ambition of theirs—which may be forgiven; for every man ought to be loved who says and manfully pursues and works out anything which is at all like wisdom: at the same time we shall do well to see them as they really are.\n\n\nCri.\n\nCrito wants to educate one of his sons, but the teachers of philosophy are such strange beings that he cannot trust him to them.\n\nI have often told you, Socrates, that I am in a constant difficulty about my two sons. What am I to do with them? There is no hurry about the younger one, who is only a child; but the other, Critobulus, is getting on, and needs some one who will improve him. I cannot help thinking, when I hear you talk, that there is a sort of madness in many of our anxieties about our children:—in the first place, about marrying a wife of good family to be the mother of them, and then about heaping up money for them—and yet taking no care about their education. But then again, when I contemplate any of those who pretend to educate others, I am amazed. To me, if I am to confess the truth, they all seem to be such outrageous beings: so that I do not know how I can advise the youth to study philosophy.\n\n\nSoc.",
        "question": "\nThen are they not animals?\n",
        "answer": "Cri."
    },
    {
        "context": "Certainly they are, in my judgment.\n\n\nSoc.",
        "question": "\n\nAnd you admitted that of animals those are yours which you could give away or sell or offer in sacrifice, as you pleased?\n",
        "answer": "Cri."
    },
    {
        "context": "Yes, indeed, that is very true.\n\nSoc.",
        "question": "\nWell then, said he, if you admit that Zeus and the other gods are yours, can you sell them or give them away or do what you will with them, as you would with other animals?\n",
        "answer": "Cri."
    },
    {
        "context": "That would not be reasonable, Socrates.\n\n\nSoc.\n\nLet him think, not of the goodness or badness of the teachers, but of the truth of philosophy.\n\nDo you then be reasonable, Crito, and do not mind whether the teachers of philosophy are good or bad, but think only of philosophy herself. Try and examine her well and truly, and if she be evil seek to turn away all men from her, and not your sons only; but if she be what I believe that she is, then follow her and serve her, you and your house, as the saying is, and be of good cheer.\n\n\n\nCRATYLUS.",
        "question": " was he an orator who himself practises in the courts, or an instructor of orators, who makes the speeches with which they do battle?\n",
        "answer": ""
    },
    {
        "context": "",
        "question": "\nDear Crito, do you not know that in every profession the inferior sort are numerous and good for nothing, and the good are few and beyond all price: for example, are not gymnastic and rhetoric and money–making and the art of the general, noble arts?\n",
        "answer": ""
    },
    {
        "context": "",
        "question": "\nWell, and do you not see that in each of these arts the many are ridiculous performers?\n",
        "answer": ""
    },
    {
        "context": "",
        "question": "\nAnd will you on this account shun all these pursuits yourself and refuse to allow them to your son?\n",
        "answer": ""
    }
]